{
  "Frontend Developer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past learning experience has prepared you the most for a front-end role?",
        "What excites you the most about working as a front-end developer?",
        "How do you stay disciplined and consistent when working on long or repetitive UI tasks?",
        "Tell me about a moment when you realised coding was the right career path for you.",
        "How do you deal with frustration when a component doesn’t work after multiple attempts?",
        "Describe a situation where you had to learn a new tool or framework quickly. How did you approach it?"
      ],
      "Pool2": [
        "Describe the concrete steps you take to make an interface accessible (e.g., ARIA roles, keyboard flows, colour contrast). Why is this important?",
        "Explain the difference between class selectors, ID selectors, and attribute selectors in CSS. When should each be used?",
        "What is the DOM, and how does JavaScript interact with it?",
        "What is the difference between inline, inline-block, and block elements in HTML?",
        "Explain how flexbox works. When would you choose flexbox over grid?",
        "Describe how browser caching works for front-end assets.",
        "What are semantic HTML tags? Why do we use them?",
        "Explain how responsive design works. What tools or CSS properties help achieve it?",
        "How do you optimise images and static assets for faster page loading?"
      ],
      "Pool3": [
        "Tell me about the toughest front-end bug or integration challenge you solved recently—how did you diagnose it, and what was the outcome?",
        "Describe a time when you were asked to redesign or rebuild a component. How did you handle user feedback and technical constraints?",
        "Talk about a time when working with a backend API was difficult—what did you do to ensure the UI still functioned smoothly?",
        "Give an example of a time you faced a difficult challenge. What did you do about it?",
        "Describe a situation where you improved performance or reduced load time—what steps did you take?",
        "Tell me about a front-end feature you built that you’re most proud of. Why does it stand out?",
        "Describe a time when you had to work under a very tight deadline. What strategies helped you deliver?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you stay disciplined and consistent when working on long or repetitive UI tasks?",
        "Tell me about a moment when you realised coding was the right career path for you.",
        "How do you deal with frustration when a component doesn’t work after multiple attempts?",
        "Describe a situation where you had to learn a new tool or framework quickly. How did you approach it?",
        "How do you handle feedback on your design or code, especially when you disagree with it?",
        "What do you do when faced with conflicting priorities—like fixing bugs vs. shipping new features?",
        "Give an example of a team situation where you took responsibility even without being asked.",
        "What do you think is the most important personal quality a front-end developer needs, and how do you embody it?"
      ],
      "Pool2": [
        "How do you implement media queries in React, and what steps do you take to ensure the UI adapts well on Android, iPad, and laptops?",
        "Explain the difference between client-side rendering, server-side rendering, and static site generation. When do you use each?",
        "What strategies do you use to reduce bundle size and improve React app performance?",
        "Explain the reconciliation process in React. How does React decide what to re-render?",
        "How do you manage application-wide state? Compare Redux, Context API, and other options.",
        "How do you handle debouncing or throttling in search bars or scroll-based events?",
        "What is lazy loading, and how do you implement it in React?",
        "How do you manage environment variables and configuration for different environments (dev, staging, production)?",
        "When working with APIs, how do you handle loading states, caching, and error states in the UI?",
        "What security risks exist in front-end apps (XSS, CSRF, content injection), and how do you mitigate them?"
      ],
      "Pool3": [
        "Tell me about the toughest front-end bug or integration challenge you solved recently—how did you diagnose it, and what was the outcome?",
        "Describe a time when you were asked to redesign or rebuild a component. How did you handle user feedback and technical constraints?",
        "Talk about a time when working with a backend API was difficult—what did you do to ensure the UI still functioned smoothly?",
        "Tell me about a time when you had to choose between a quick fix and a long-term solution. What did you decide and why?",
        "Describe a situation when you collaborated with a designer. How did you bridge the gap between design expectations and technical feasibility?",
        "Talk about a moment when you had conflicting opinions with your teammates on how to build a feature. How did you resolve it?",
        "Tell me about a front-end feature you built that you’re most proud of. Why does it stand out?",
        "Describe a time when you had to work under a very tight deadline. What strategies helped you deliver?"
      ]
    }
  },
  "Backend Developer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past learning experience has prepared you the most for a backend development role?",
        "What motivates you to pursue backend development?",
        "Tell me about a moment when you realised you enjoy solving backend or system-level problems.",
        "How do you stay calm and systematic when production issues or server errors arise?",
        "Describe a time when you learned a new backend technology or concept quickly. How did you approach it?",
        "Backend work often involves invisible tasks. How do you stay motivated without immediate visual results?",
        "What personal quality do you think is most important for a backend developer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain the difference between REST APIs, GraphQL, and SOAP.",
        "What is the purpose of HTTP methods like GET, POST, PUT, PATCH, and DELETE?",
        "Describe how a server handles a request–response cycle.",
        "What is the difference between SQL databases and NoSQL databases? Give examples.",
        "Explain how authentication differs from authorization.",
        "What is middleware in backend frameworks (e.g., Express.js, Django, Spring Boot)?",
        "Explain indexing in databases. How does it improve query performance?",
        "What is CORS and why is it important?",
        "What is environment-based configuration? Why shouldn’t sensitive data be hard-coded?",
        "What are status codes? Explain common codes like 200, 400, 401, 403, 404, and 500."
      ],
      "Pool3": [
        "Tell me about the most difficult backend bug you solved—how did you diagnose it and what was the final fix?",
        "Describe a time when your API was working locally but failing in production. What steps did you take to find the issue?",
        "Tell me about a performance bottleneck you resolved. What tools or methods helped you?",
        "Tell me about a situation where you redesigned or refactored a backend module to make it more efficient.",
        "Tell me about a moment when you had to work on a feature with a very tight deadline. How did you plan and deliver?",
        "Tell me about a backend feature you built that you’re most proud of. Why does it stand out?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "Tell me about a moment when you realised you enjoy solving backend or system-level problems.",
        "How do you stay calm and systematic when production issues or server errors arise?",
        "Describe a time when you learned a new backend technology or concept quickly. How did you approach it?",
        "Backend work often involves invisible tasks. How do you stay motivated without immediate visual results?",
        "How do you handle feedback on your architecture, code quality, or API design?",
        "Tell me about a time you took responsibility for a backend issue even when the root cause wasn’t obvious.",
        "How do you manage conflicting priorities—like feature building, refactoring, and fixing bugs?",
        "What personal quality do you think is most important for a backend developer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain how you design a scalable API that can handle high traffic.",
        "How do you structure a backend application so that it remains modular and maintainable?",
        "Describe the steps you take to optimize slow database queries.",
        "How do you implement caching? Compare Redis, in-memory caching, and CDN-based caching.",
        "Explain how JWT works and how you secure token-based authentication.",
        "How do you handle file uploads safely, especially large files?",
        "Describe rate limiting. How do you implement it and why is it important?",
        "How do you detect and prevent common security threats like SQL injection, XSS, and CSRF?",
        "Explain message queues. Why and when would you use systems like RabbitMQ, Kafka, or AWS SQS?",
        "How do you handle database migrations in production without downtime?"
      ],
      "Pool3": [
        "Tell me about the most difficult backend bug you solved—how did you diagnose it and what was the final fix?",
        "Describe a time when your API was working locally but failing in production. What steps did you take to find the issue?",
        "Describe a time when you had to collaborate closely with front-end developers to design an API. What made it challenging?",
        "Tell me about a situation where you redesigned or refactored a backend module to make it more efficient.",
        "Describe a time when you had to deal with poor documentation or unclear requirements. What did you do?",
        "Tell me about a moment when you had to work on a feature with a very tight deadline. How did you plan and deliver?",
        "Describe a situation where you had to handle data inconsistency issues. How did you identify the cause?",
        "Describe a time a deployment went wrong. What happened, how did you respond, and what did you learn?"
      ]
    }
  },
  "UX Designer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you to think from a user’s perspective?",
        "What excites you the most about becoming a UX designer?",
        "UX often involves multiple iterations. How do you stay motivated when your designs are repeatedly changed or rejected?",
        "Tell me about a moment when you realised you enjoy understanding user behaviour.",
        "How do you handle feedback that contradicts your design choices?",
        "UX design requires patience and empathy. How do you practice both in your work?",
        "What personal quality do you believe is most important for a UX designer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is your approach to understanding user needs before starting any design?",
        "Explain the difference between UX and UI design. Why are both important?",
        "What are user personas, and how do they guide design decisions?",
        "Describe what usability testing is. When should it be conducted?",
        "What are wireframes? How do they differ from prototypes?",
        "Explain Nielsen’s 10 Usability Heuristics and name at least three.",
        "What is information architecture? Why is it important in UX?",
        "How do you define user journeys and task flows?",
        "What tools do you use for low-fidelity and high-fidelity designs?",
        "Describe the importance of accessibility in UX design."
      ],
      "Pool3": [
        "Tell me about a UX problem you solved that had a major impact on user satisfaction. How did you approach it?",
        "Tell me about a time you redesigned a feature or flow. What improvements were made and how did you measure success?",
        "Tell me about a time when you simplified a complex interface. What was the result?",
        "Describe a time you conducted usability testing. What insights did you gain and how did they shape the final design?",
        "Tell me about a UX design you are most proud of. Why does it stand out?",
        "Describe a time your design failed or didn’t perform as expected. What did you learn from it?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "UX often involves multiple iterations. How do you stay motivated when your designs are repeatedly changed or rejected?",
        "How do you handle feedback that contradicts your design choices?",
        "Describe a time when you stepped in to solve a design-related problem even though it wasn’t assigned to you.",
        "What do you do when you feel creatively stuck or unable to generate new ideas?",
        "How do you balance user needs with business requirements when they conflict?",
        "UX design requires patience and empathy. How do you practice both in your work?",
        "What personal quality do you believe is most important for a UX designer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you plan and conduct user research when there is very little time or budget?",
        "Explain how you create, implement, or maintain a design system.",
        "How do you use analytics or behaviour-tracking tools (e.g., Hotjar, Google Analytics) to guide UX decisions?",
        "How do you validate whether a design change has actually improved user experience?",
        "What is cognitive load, and how do you reduce it in your designs?",
        "Explain how you conduct A/B testing and how you interpret the results.",
        "How do you design for multiple devices—mobile, tablet, and desktop—while maintaining consistency?",
        "How do you hand off your designs to developers to ensure accuracy?",
        "Describe how you use inclusive design principles when creating user experiences.",
        "What steps do you take to ensure user data privacy and compliance (e.g., GDPR) within UX design?"
      ],
      "Pool3": [
        "Tell me about a UX problem you solved that had a major impact on user satisfaction. How did you approach it?",
        "Describe a situation where your research findings contradicted stakeholder opinions. What did you do?",
        "Describe a moment when you had very unclear or incomplete requirements. How did you proceed?",
        "Tell me about a time when you simplified a complex interface. What was the result?",
        "Describe a situation where deadlines were tight, but user research was still needed. How did you balance both?",
        "Tell me about a conflict with a developer or product manager regarding a design decision. How did you resolve it?",
        "Describe a time you conducted usability testing. What insights did you gain and how did they shape the final design?",
        "Describe a time your design failed or didn’t perform as expected. What did you learn from it?"
      ]
    }
  },
  "Marketing": {
    "Basic": {
      "Pool1": [
        "What in your graduation or experience has prepared you for a marketing role?",
        "What excites you the most about working in marketing?",
        "Marketing requires constant creativity. How do you stay inspired when ideas don’t come easily?",
        "Tell me about a moment when you realised you enjoy understanding customer behaviour.",
        "How do you handle negative feedback on your campaign ideas or strategies?",
        "Describe a time when you took initiative to solve a marketing-related challenge without being asked.",
        "What personal quality do you believe is most important for a marketer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain the 4Ps of marketing. How do they guide campaign creation?",
        "What is the difference between branding and marketing?",
        "What is a target audience? How do you define it for a new product?",
        "Explain what a customer journey is.",
        "What is segmentation? Why is it important in marketing?",
        "Describe organic vs. paid marketing with an example.",
        "What is a value proposition? Why does it matter?",
        "What are the key metrics you track in a basic marketing campaign?",
        "What is competitor analysis, and how do you conduct it?",
        "Explain the importance of storytelling in marketing."
      ],
      "Pool3": [
        "Tell me about a marketing campaign you worked on in college or in your locality. What made it successful?",
        "Tell me about a situation where you disagreed with the creative direction proposed by the team. How did you handle it?",
        "Give an example of a time you had to work under a very tight deadline for a campaign launch.",
        "Tell me about a time you managed a social media crisis or negative comments. What did you do?",
        "Describe a situation where you created a low-budget campaign that still performed well.",
        "Tell me about a marketing idea you’re especially proud of. What impact did it have?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a marketing role?",
        "What excites you the most about working in marketing?",
        "How do you handle negative feedback on your campaign ideas or strategies?",
        "Describe a time when you took initiative to solve a marketing-related challenge without being asked.",
        "How do you stay updated with trends and changes in the marketing world?",
        "What do you do when a campaign does not perform well despite your effort?",
        "How do you balance creativity with business needs and budget constraints?"
      ],
      "Pool2": [
        "How do you create a complete marketing funnel for a new product?",
        "Explain how you measure campaign effectiveness using analytics tools (Google Analytics, Meta Ads, etc.).",
        "How do you run A/B testing for ads or landing pages?",
        "Explain SEO vs. SEM. When do you use each?",
        "What strategies do you use to improve conversion rates on a landing page?",
        "How do you build and manage a brand’s social media presence?",
        "What steps do you take to develop a content marketing strategy?",
        "Explain how retargeting works and why it is effective.",
        "How do you handle a situation where the cost per lead (CPL) keeps increasing?",
        "Describe the process of creating a multi-channel campaign and ensuring message consistency."
      ],
      "Pool3": [
        "Describe a time when your campaign underperformed. What did you do to fix it?",
        "Tell me about a situation where you disagreed with the creative direction proposed by the team. How did you handle it?",
        "Describe a moment when you used customer insights to improve a marketing decision.",
        "Give an example of a time you had to work under a very tight deadline for a campaign launch.",
        "Describe a situation where you created a low-budget campaign that still performed well.",
        "Tell me about a moment when you identified a new market opportunity and recommended it to the team.",
        "Describe a time when collaboration with sales or product teams helped improve a campaign outcome."
      ]
    }
  },
  "Sales Executive": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a sales role?",
        "What motivates you the most about working in sales?",
        "Sales involve frequent rejection. How do you stay motivated?",
        "Tell me about a moment when you realised you enjoy building relationships with people.",
        "Describe a time you took the initiative to close a deal or help a customer without being asked.",
        "How do you balance being persuasive with being respectful and ethical?",
        "What personal quality do you think is most important for a Sales Executive, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is the sales funnel? Explain each stage briefly.",
        "What does “qualifying a lead” mean? How do you do it?",
        "Explain the difference between B2B and B2C sales.",
        "What are open-ended questions in sales? Why are they useful?",
        "How do you identify customer needs during a conversation?",
        "What are the key components of a good sales pitch?",
        "Explain the importance of product knowledge in sales.",
        "What is rapport building? How do you build rapport with a new customer?",
        "What is objection handling? List some common objections.",
        "Why is follow-up important after the first interaction?"
      ],
      "Pool3": [
        "Tell me about the toughest sale you closed. What made it difficult, and how did you win it?",
        "Tell me about a situation where you turned a dissatisfied customer into a happy one.",
        "Describe a moment when you lost a major deal. What did you learn from it?",
        "Tell me about a time you had to convince a skeptical person. How did you approach it?",
        "Describe a situation where you had to handle a person’s objections. What was your strategy?",
        "Describe a moment when teamwork helped you close a deal."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Sales involve frequent rejection. How do you stay motivated?",
        "How do you react when a client dismisses or challenges your pitch?",
        "Describe a time you took the initiative to close a deal or help a customer without being asked.",
        "How do you handle pressure when you have monthly or weekly sales targets?",
        "What do you do when you feel your sales performance is not improving?",
        "How do you balance being persuasive with being respectful and ethical?"
      ],
      "Pool2": [
        "Explain how you plan and manage your sales pipeline effectively.",
        "Describe your approach to negotiating pricing with a customer.",
        "What are common closing techniques you use?",
        "How do you use CRM tools (e.g., HubSpot, Zoho, Salesforce) to manage leads?",
        "How do you track sales performance metrics like leads, conversions, and revenue?",
        "How do you identify upselling and cross-selling opportunities?",
        "What strategies do you use to reduce customer churn or increase retention?",
        "Explain how you handle customers who go silent after showing initial interest.",
        "How do you create urgency without pressuring the client unethically?",
        "What steps do you take to prepare for a sales presentation or meeting?"
      ],
      "Pool3": [
        "Tell me about the toughest sale you closed. What made it difficult, and how did you win it?",
        "Tell me about a situation where you turned a dissatisfied customer into a happy one.",
        "Describe a moment when you lost a major deal. What did you learn from it?",
        "Tell me about a time when you exceeded your sales targets. What contributed to your success?",
        "Describe a moment when teamwork helped you close a deal.",
        "Tell me about a time when you adapted your pitch for different customer segments.",
        "Describe a time when a deal was stuck for too long. How did you revive the conversation?"
      ]
    }
  },
  "Project Management": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a project management role?",
        "What motivates you most about managing projects and teams?",
        "Project management often involves pressure and deadlines. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoy planning, organizing, or coordinating work.",
        "How do you react when your project plan is challenged or changed by stakeholders?",
        "Describe a time you took initiative to solve a project issue without being asked.",
        "How do you handle situations where your team members miss deadlines or commitments?",
        "What do you do to improve yourself as a project manager when you notice gaps in your skills?",
        "How do you balance project constraints like time, budget, and quality when they conflict?",
        "What personal quality do you believe is most important for a project manager, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What are the five phases of the project life cycle?",
        "What is a project charter? Why is it important?",
        "Explain the difference between a project and operations.",
        "What is scope in project management? How do you define it?",
        "What tools do you use for project planning and scheduling (e.g., Gantt charts)?",
        "What is risk identification? Give an example.",
        "What is a stakeholder? How do you manage stakeholder expectations?",
        "Explain the difference between milestones and deliverables.",
        "Why is documentation important in project management?"
      ],
      "Pool3": [
        "Tell me about the most challenging project you managed. What made it tough, and how did you handle it?",
        "Describe a situation where a project was falling behind schedule. What steps did you take?",
        "Tell me about a conflict between team members. How did you resolve it?",
        "Tell me about a time you managed a project with unclear or changing requirements.",
        "Describe how you handled a major risk that suddenly became an issue.",
        "Tell me about a project where your leadership directly improved team performance.",
        "Describe a time when a deliverable failed or did not meet expectations. What did you learn?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a project management role?",
        "What motivates you most about managing projects and teams?",
        "Project management often involves pressure and deadlines. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoy planning, organizing, or coordinating work.",
        "How do you react when your project plan is challenged or changed by stakeholders?",
        "Describe a time you took initiative to solve a project issue without being asked.",
        "How do you handle situations where your team members miss deadlines or commitments?",
        "What do you do to improve yourself as a project manager when you notice gaps in your skills?",
        "How do you balance project constraints like time, budget, and quality when they conflict?",
        "What personal quality do you believe is most important for a project manager, and how do you demonstrate it?"
      ],
      "Pool2": [
        "Explain the difference between Agile, Waterfall, and Hybrid methodologies.",
        "How do you estimate project timelines using techniques like PERT or critical path method?",
        "How do you perform qualitative and quantitative risk analysis?",
        "Explain how you manage project scope creep.",
        "What strategies do you use for resource allocation and workload balancing?",
        "Describe your approach to budgeting and cost management.",
        "How do you measure project performance using KPIs or Earned Value Management (EVM)?",
        "What communication plan do you create for complex projects with multiple stakeholders?",
        "How do you manage vendor relationships and third-party dependencies?",
        "How do you conduct a project retrospective and ensure learnings are applied?"
      ],
      "Pool3": [
        "Tell me about the most challenging project you managed. What made it tough, and how did you handle it?",
        "Describe a situation where a project was falling behind schedule. What steps did you take?",
        "Tell me about a conflict between team members. How did you resolve it?",
        "Tell me about a time you managed a project with unclear or changing requirements.",
        "Describe how you handled a major risk that suddenly became an issue.",
        "Tell me about a time you had to manage multiple projects simultaneously. How did you prioritize?",
        "Describe a situation where your project exceeded the planned budget. What corrective actions did you take?",
        "Describe a time when a deliverable failed or did not meet expectations. What did you learn?"
      ]
    }
  },
  "Civil Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experiences has prepared you for a role as a civil engineer?",
        "What motivates you to pursue civil engineering as a career?",
        "Civil engineering projects can be high-pressure. How do you stay calm and focused on-site?",
        "Tell me about a moment when you realised you enjoy solving real-world structural or construction problems.",
        "How do you handle feedback or criticism on your design or estimation work?",
        "How do you ensure accuracy and attention to detail while preparing drawings, estimates, or reports?",
        "How do you stay updated with new construction techniques or industry standards?",
        "What personal quality do you believe is essential for a civil engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What are the main types of cement? Where is each type used?",
        "Explain the difference between working stress method and limit state method.",
        "What are the common tests used to check the quality of concrete?",
        "What is the purpose of surveying in civil engineering?",
        "Explain compaction and its importance in soil engineering.",
        "What is the difference between a slab, beam, and column?",
        "What is slump test in concrete? What does it indicate?",
        "Explain the concept of factor of safety.",
        "What is the difference between dead load and live load?",
        "What are the common types of foundations? Give examples."
      ],
      "Pool3": [
        "Tell me about a construction or structural issue you solved. What steps did you take to diagnose and fix it?",
        "Describe a situation where your project was getting delayed. What did you do to bring it back on schedule?",
        "Describe a time you managed conflict between contractors, workers, or stakeholders.",
        "Tell me about a scenario where unexpected soil conditions affected your project. How did you handle it?",
        "Describe a challenging estimation or quantity surveying task you completed.",
        "Tell me about a time you worked under tight deadlines or adverse weather conditions.",
        "Describe a project where you contributed significantly to cost reduction, safety, or quality improvement."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Civil engineering projects can be high-pressure. How do you stay calm and focused on-site?",
        "Tell me about a moment when you realised you enjoy solving real-world structural or construction problems.",
        "How do you handle feedback or criticism on your design or estimation work?",
        "Describe a time you took initiative to solve an engineering or technical problem without being asked.",
        "How do you ensure accuracy and attention to detail while preparing drawings, estimates, or reports?",
        "How do you stay updated with new construction techniques or industry standards?",
        "Civil work often happens outdoors in challenging environments. How do you balance safety and productivity?",
        "What personal quality do you believe is essential for a civil engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you determine the type of foundation required based on soil conditions?",
        "Explain how you design a reinforced concrete beam for bending and shear.",
        "How do you conduct a mix design for M-grade concrete?",
        "What steps do you take to ensure quality control during construction?",
        "Explain how you estimate cost, materials, and quantity for a large project.",
        "How do you select appropriate construction materials for durability and environment?",
        "What is pre-stressed concrete? When is it preferred over RCC?",
        "Explain the difference between static and dynamic load analysis.",
        "How do you manage waterlogging and drainage issues at a construction site?",
        "How do you apply relevant codes (IS codes or standards) in design and construction?"
      ],
      "Pool3": [
        "Tell me about a time when you had to enforce safety rules on-site. How did you handle resistance?",
        "Describe a situation where a design was not feasible on-site. How did you modify or resolve it?",
        "Tell me about a moment when you discovered poor workmanship. What actions did you take?",
        "Describe a time you managed conflict between contractors, workers, or stakeholders.",
        "Tell me about a scenario where unexpected soil conditions affected your project. How did you handle it?",
        "Describe a challenging estimation or quantity surveying task you completed.",
        "Tell me about a time you worked under tight deadlines or adverse weather conditions.",
        "Describe a project where you contributed significantly to cost reduction, safety, or quality improvement."
      ]
    }
  },
  "Mechanical Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a mechanical engineering role?",
        "What motivates you to work in mechanical engineering?",
        "Mechanical engineering often involves problem-solving under pressure. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoyed understanding how machines and systems work.",
        "How do you handle feedback or criticism on your designs, calculations, or reports?",
        "How do you ensure accuracy in measurements, drawings, or simulations?",
        "How do you stay updated with new manufacturing methods or mechanical technologies?",
        "What personal quality do you believe is essential for a mechanical engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "State the first law of thermodynamics. How is it applied in real systems?",
        "What is the difference between stress and strain?",
        "Explain the concepts of laminar flow and turbulent flow.",
        "What is entropy? Why is it important?",
        "Describe different types of fits (interference, clearance, transition).",
        "What are the common manufacturing processes (casting, forging, machining, welding)?",
        "What is Bernoulli’s equation? Where is it used?",
        "Explain the difference between a boiler and a heat exchanger.",
        "What is fatigue failure? What causes it?",
        "What are the common types of gears? Give examples of where each is used."
      ],
      "Pool3": [
        "Tell me about a mechanical or thermal problem you solved. How did you diagnose it?",
        "Describe a time when a machine or system failed unexpectedly. What did you do?",
        "Tell me about a situation where you improved a design, process, or component.",
        "Describe a situation where you had to coordinate with electrical, civil, or production teams.",
        "Tell me about a design that initially failed testing. How did you revise it?",
        "Tell me about a quality control issue you resolved.",
        "Describe a project where your contribution significantly improved efficiency, cost, or reliability."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Mechanical engineering often involves problem-solving under pressure. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoyed understanding how machines and systems work.",
        "How do you handle feedback or criticism on your designs, calculations, or reports?",
        "Describe a time you took initiative to fix a mechanical or technical problem without being asked.",
        "How do you stay updated with new manufacturing methods or mechanical technologies?",
        "What do you do when a machine or experiment repeatedly fails during testing?",
        "What personal quality do you believe is essential for a mechanical engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you approach designing a machine component to withstand dynamic loads?",
        "Explain how you would calculate heat transfer through a composite wall.",
        "How do you select materials based on strength, temperature, and environmental requirements?",
        "What steps do you take to perform a finite element analysis (FEA) on a component?",
        "Explain how CNC machines work and how you prepare a part program.",
        "How do you optimize a production system using lean manufacturing principles?",
        "Explain how a refrigeration cycle works and its major components.",
        "How do you evaluate vibration in rotating machinery?",
        "Describe the difference between hydraulic and pneumatic systems. When would you use each?",
        "How do you incorporate safety standards and tolerances into mechanical design?"
      ],
      "Pool3": [
        "Describe a time when a machine or system failed unexpectedly. What did you do?",
        "Tell me about a situation where you improved a design, process, or component.",
        "Describe a moment when you had to deal with limited resources or a tight budget.",
        "Tell me about a time you noticed a safety risk during manufacturing or testing. What did you do?",
        "Describe a situation where you had to coordinate with electrical, civil, or production teams.",
        "Tell me about a design that initially failed testing. How did you revise it?",
        "Describe a time you worked under tight deadlines for fabrication or assembly.",
        "Describe a project where your contribution significantly improved efficiency, cost, or reliability."
      ]
    }
  },
  "Electrical Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for an electrical engineering role?",
        "What motivates you to pursue electrical engineering as a career?",
        "Electrical work involves strict safety compliance. How do you stay disciplined and careful on-site or in labs?",
        "Tell me about a moment when you realised you enjoy working with circuits, machines, or electrical systems.",
        "How do you maintain accuracy and avoid mistakes while working on complex circuits?",
        "How do you stay updated with new technologies or electrical standards?",
        "What do you do when you face repeated failures during testing or prototyping?",
        "What personal quality do you believe is essential for an electrical engineer, and how do you embody it?"
      ],
      "Pool2": [
        "What is Ohm’s Law? Give a practical example.",
        "Explain the difference between AC and DC supply.",
        "What are the main types of electrical machines (motors and generators)?",
        "What is power factor? Why is it important?",
        "Explain Kirchhoff’s Current Law (KCL) and Voltage Law (KVL).",
        "What are transformers used for?",
        "What is the difference between a fuse and a circuit breaker?",
        "Explain the purpose of earthing/grounding in electrical systems.",
        "What are the common types of electrical loads?",
        "What are capacitors and inductors? Give basic applications for each."
      ],
      "Pool3": [
        "Tell me about a complex electrical problem you solved. How did you diagnose and fix it?",
        "Tell me about a time you implemented a design improvement to increase efficiency or safety.",
        "Tell me about a time you identified a major safety risk. What did you do next?",
        "Describe a situation where you worked with other engineering teams (mechanical, civil, electronics) to solve an issue.",
        "Tell me about a design or calculation that initially failed. How did you revise it?",
        "Describe a moment when you had to troubleshoot complex equipment with limited documentation.",
        "Tell me about a maintenance challenge you resolved under tight deadlines.",
        "Describe a project where your contribution significantly improved reliability, cost, or energy efficiency."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Electrical work involves strict safety compliance. How do you stay disciplined and careful on-site or in labs?",
        "Tell me about a moment when you realised you enjoy working with circuits, machines, or electrical systems.",
        "How do you respond when your calculations or circuit designs are challenged or criticised?",
        "Describe a time you took initiative to diagnose or fix an electrical issue without being asked.",
        "How do you maintain accuracy and avoid mistakes while working on complex circuits?",
        "How do you stay updated with new technologies or electrical standards?",
        "What do you do when you face repeated failures during testing or prototyping?",
        "What personal quality do you believe is essential for an electrical engineer, and how do you embody it?"
      ],
      "Pool2": [
        "How do you select the right transformer for a given load and voltage level?",
        "Explain how you analyse harmonics and their impact on electrical systems.",
        "Describe the working principle of a three-phase induction motor.",
        "How do you design and evaluate protection schemes like relays and circuit breakers?",
        "Explain how you calculate fault levels in a distribution system.",
        "How do you perform load flow analysis? What tools or methods do you use?",
        "Explain PID control and where it is used in electrical engineering.",
        "How do you size cables based on current, temperature, and installation conditions?",
        "Describe how renewable energy sources (solar, wind) integrate into the grid.",
        "What steps do you take to improve energy efficiency in electrical systems?"
      ],
      "Pool3": [
        "Tell me about a complex electrical problem you solved. How did you diagnose and fix it?",
        "Describe a situation where an electrical system failed or tripped unexpectedly. What actions did you take?",
        "Tell me about a time you implemented a design improvement to increase efficiency or safety.",
        "Describe a moment when you had to handle a high-pressure situation involving power failure or urgent repair.",
        "Describe a moment when you had to troubleshoot complex equipment with limited documentation.",
        "Tell me about a maintenance challenge you resolved under tight deadlines.",
        "Describe a project where your contribution significantly improved reliability, cost, or energy efficiency."
      ]
    }
  },
  "Electronics and Communication (Embedded Systems and IoT)": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for the role?",
        "What excites you the most about working with embedded hardware or IoT technologies?",
        "Embedded work often requires long debugging hours. How do you stay patient and focused?",
        "Tell me about a moment when you realised you enjoy building or troubleshooting electronics.",
        "How do you stay updated with new microcontrollers, sensors, protocols, and IoT technologies?",
        "What do you do when unexpected behaviour occurs during testing of embedded devices?",
        "What personal quality do you believe is essential for an embedded/IoT engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is the difference between a microcontroller and a microprocessor?",
        "Explain the functioning of GPIO pins. Give an example of use.",
        "What is the purpose of ADC and DAC in embedded systems?",
        "Explain common communication protocols such as UART, I2C, SPI.",
        "What is PWM? Where is it used?",
        "Describe the difference between analog and digital sensors.",
        "What is a pull-up resistor, and why is it used?",
        "Explain the basic architecture of Arduino or ESP32.",
        "What is debouncing in embedded systems?",
        "What is a watchdog timer, and why is it important?"
      ],
      "Pool3": [
        "Tell me about the most challenging embedded system bug you solved. How did you debug it?",
        "Describe a situation where your device worked in the lab but failed in the field. What did you do?",
        "Tell me about a time when your sensor readings were inaccurate. How did you correct them?",
        "Describe a moment when your communication protocol failed or behaved unpredictably.",
        "Tell me about a time you built a prototype under tight deadlines.",
        "Tell me about a moment when you improved the power efficiency or performance of an embedded device.",
        "Tell me about a scenario where your IoT device lost connectivity. What steps did you take to diagnose the issue?",
        "Describe a project where your contribution significantly improved reliability, cost, or performance."
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for embedded systems or IoT roles?",
        "Embedded work often requires long debugging hours. How do you stay patient and focused?",
        "How do you respond when your circuit or firmware doesn’t work after multiple attempts?",
        "Describe a time you took initiative to fix a hardware or software issue without being asked.",
        "How do you stay updated with new microcontrollers, sensors, protocols, and IoT technologies?",
        "How do you ensure accuracy and avoid mistakes when working with schematics, PCBs, or code?",
        "What do you do when unexpected behaviour occurs during testing of embedded devices?"
      ],
      "Pool2": [
        "How do you design an IoT system end-to-end—from sensor to cloud?",
        "What are the advantages of using RTOS over bare-metal programming?",
        "Explain how you optimize power consumption in battery-powered IoT devices.",
        "How do you choose between different wireless communication protocols (BLE, LoRa, Zigbee, Wi-Fi)?",
        "Describe how OTA (Over-The-Air) firmware updates work and how you implement them.",
        "How do you secure IoT devices against common cyber threats?",
        "What steps do you take to ensure reliable communication in noisy environments?",
        "How do you handle memory constraints in microcontrollers?",
        "Explain MQTT protocol. When is it preferred over HTTP?",
        "Describe how you integrate embedded devices with cloud platforms (AWS IoT, Azure IoT, Google Cloud IoT)."
      ],
      "Pool3": [
        "Describe a situation where your device worked in the lab but failed in the field. What did you do?",
        "Tell me about a time when your sensor readings were inaccurate. How did you correct them?",
        "Describe a moment when your communication protocol failed or behaved unpredictably.",
        "Tell me about a time you built a prototype under tight deadlines.",
        "Describe a situation where you had to coordinate with hardware and software teams to solve an issue.",
        "Tell me about a moment when you improved the power efficiency or performance of an embedded device.",
        "Describe a time a PCB you designed or used had issues. How did you troubleshoot it?",
        "Tell me about a scenario where your IoT device lost connectivity. What steps did you take to diagnose the issue?"
      ]
    }
  },
  "Business Analyst": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experiences has prepared you for a business analyst role?",
        "What motivates you to work as a business analyst?",
        "Business analysis requires strong attention to detail. How do you stay organised during complex tasks?",
        "Tell me about a moment when you realised you enjoy analysing data, processes, or requirements.",
        "How do you respond when stakeholders question your analysis or documentation?",
        "Describe a time you took initiative to solve a business problem without being asked.",
        "How do you balance user needs with business constraints?",
        "What do you do when a requirement is unclear or contradictory?",
        "How do you stay updated with tools, frameworks, and industry trends relevant to business analysis?",
        "What personal quality do you believe is essential for a business analyst, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is the primary role of a business analyst in a project?",
        "Explain the difference between requirements and specifications.",
        "What is a user story? What are its components?",
        "What is a process flow diagram?",
        "What are KPIs and why are they important?",
        "What is stakeholder mapping?",
        "Explain the difference between qualitative and quantitative data?",
        "What is a gap analysis?",
        "What is requirement traceability?",
        "What is the purpose of acceptance criteria?"
      ],
      "Pool3": [
        "Describe a time when limited data made your analysis difficult. What did you do?",
        "Tell me about a moment when you improved a small process or routine.",
        "Describe a situation where you clarified requirements for someone.",
        "Tell me about a time you worked with someone who disagreed with your approach.",
        "Describe a moment where you had to explain a concept to a non-technical person.",
        "Tell me about a time when you had to meet a deadline with minimal guidance.",
        "Describe a situation where your assumption turned out to be wrong.",
        "Tell me about a time you helped your team solve a problem.",
        "Describe a time when two people misunderstood each other. How did you help?",
        "Tell me about a moment where you handled conflicting expectations."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you handle situations where stakeholders disagree with your analysis?",
        "What do you do when a business decision you recommended is not accepted?",
        "Describe how you ensure your work remains unbiased when analysing conflicting data.",
        "How do you prioritise tasks when everything seems urgent?",
        "Tell me about a time you took full responsibility for a mistake in your analysis.",
        "How do you adapt when project requirements or goals change suddenly?",
        "Describe a time you resolved a communication gap between two teams.",
        "How do you push back professionally when a deadline is unrealistic?",
        "What do you do to maintain a long-term problem-solving mindset under pressure?"
      ],
      "Pool2": [
        "How do you gather complex requirements from multiple stakeholders?",
        "Explain how you use tools like SQL, Excel, or Power BI for analysis.",
        "How do you create AS-IS and TO-BE process models?",
        "Explain MoSCoW prioritisation with an example.",
        "Describe the 5 Whys or Fishbone method for root-cause analysis.",
        "How do you validate requirements to avoid rework?",
        "Explain how you conduct feasibility analysis (technical, operational, financial).",
        "How do you document non-functional requirements effectively?",
        "How do you prepare wireframes or prototypes to validate ideas?",
        "How do you measure the success of a solution post-implementation?"
      ],
      "Pool3": [
        "Tell me about a complex business problem you solved using data.",
        "Describe a time when requirements kept changing throughout the project.",
        "Tell me about a situation where two major stakeholders had opposing priorities.",
        "Describe a moment when your analysis influenced an important decision.",
        "Tell me about a time you led a requirements workshop or stakeholder meeting.",
        "Describe a situation where you uncovered a major flaw in an existing process.",
        "Tell me about a time you dealt with incomplete or contradictory data.",
        "Describe a moment when your analysis was initially wrong. How did you correct it?",
        "Tell me about a scenario where you had to balance user needs, business goals, and technical feasibility.",
        "Describe a project where your work significantly impacted business performance or efficiency."
      ]
    }
  },
  "Digital Marketing": {
    "Basic": {
      "Pool1": [
        "What interests you the most about digital marketing?",
        "What in your graduation or past experience has prepared you for this role?",
        "How do you stay motivated when a campaign does not perform well?",
        "Describe how you stay updated with online trends.",
        "How do you handle repetitive tasks like posting content or monitoring campaigns?",
        "What do you do when you face a concept or tool you don’t understand?",
        "How do you approach learning new platforms like Google Ads or Meta Ads?",
        "How do you react when your ideas are rejected by the team or client?",
        "What steps do you take to stay organised while managing multiple campaigns?",
        "How do you maintain creativity on days when inspiration is low?"
      ],
      "Pool2": [
        "What are the main channels of digital marketing?",
        "What is SEO and why is it important?",
        "Explain the difference between organic and paid marketing.",
        "What are impressions, reach, and engagement?",
        "Explain CTA (Call to Action).",
        "What is a conversion? Give an example.",
        "What is a landing page and why is it important?",
        "What tools can you use to schedule social media posts?",
        "What is the difference between B2B and B2C digital marketing?",
        "Explain the basic structure of a Google Ads search campaign."
      ],
      "Pool3": [
        "Tell me about a time you created content that performed well.",
        "Describe a situation when a client or teammate misunderstood your idea.",
        "Tell me about a moment when a campaign performed poorly. How did you react?",
        "Describe how you helped your team fix a simple marketing issue.",
        "Tell me about a time you learned a digital tool quickly to complete a task.",
        "Describe a moment when you had to work under a tight deadline.",
        "Tell me about a situation where you analysed basic campaign data to draw insights.",
        "Describe how you handled negative feedback on a design or post.",
        "Tell me about a time you identified a small improvement in a campaign.",
        "Describe how you adjusted content to match a target audience’s preferences."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Describe a time you used data to convince someone of your marketing idea.",
        "How do you handle conflict between creative direction and business goals?",
        "Digital marketing requires constant experimentation. How do you handle failures?",
        "What do you do when your marketing strategy conflicts with a client's demand?",
        "Describe how you prioritise tasks when multiple campaigns go live at once.",
        "Tell me about a time you took responsibility for a performance issue in a campaign.",
        "Explain how you balance creativity with data-driven decisions.",
        "How do you adapt when algorithms or platform rules change suddenly?",
        "Tell me about a time you influenced a decision without authority.",
        "What’s your approach when senior stakeholders push for an idea you don’t agree with?"
      ],
      "Pool2": [
        "How do you set up a full-funnel digital marketing strategy?",
        "Explain how Google Analytics or GA4 helps measure user behaviour.",
        "How do you optimise ad campaigns to reduce cost per lead (CPL)?",
        "Describe how you perform keyword research effectively.",
        "How do you conduct A/B testing for ads or landing pages?",
        "Explain how retargeting works and why it is powerful.",
        "What’s your process for improving conversion rates on a landing page?",
        "How do you build custom audiences and lookalike audiences?",
        "What KPIs would you track for an e-commerce campaign?",
        "How do you maintain cross-channel consistency in messaging?"
      ],
      "Pool3": [
        "Tell me about a campaign you managed that delivered exceptional results. What made it successful?",
        "Describe a time when you had to fix a high CPL issue. What changes did you make?",
        "Tell me about a conflict between creative teams and performance teams. How did you handle it?",
        "Describe a moment when poor data quality affected your decisions. What did you do?",
        "Tell me about a time when you redesigned an entire marketing funnel.",
        "Describe a situation where your audience targeting wasn’t working. How did you diagnose it?",
        "Tell me about a multi-channel campaign you worked on. How did you maintain consistency?",
        "Describe a moment when you had to educate a client about realistic expectations.",
        "Tell me about a time your analysis significantly improved a campaign’s ROI.",
        "Describe a project where you used insights to pivot the entire marketing strategy."
      ]
    }
  },
  "Customer Service": {
    "Basic": {
      "Pool1": [
        "What in your education or past experience has prepared you for a customer service role?",
        "What interests you the most about working in customer service?",
        "How do you stay calm when someone speaks to you rudely?",
        "Describe how you make a customer feel heard and valued.",
        "What do you do when you don’t know the answer to a customer’s question?",
        "How do you handle repetitive tasks like answering similar queries?",
        "How do you react when someone corrects your mistake?",
        "What steps do you take to stay organised during busy hours?",
        "How do you ensure you communicate clearly with customers?",
        "How do you handle pressure during peak customer call or chat times?"
      ],
      "Pool2": [
        "What is the purpose of a customer service department?",
        "What does good customer service mean to you?",
        "What is the difference between customer support and customer success?",
        "What is active listening?",
        "What are the basics of phone/email/chat etiquette?",
        "What is a support ticket?",
        "How do you record a customer complaint properly?",
        "Why is following up with customers important?",
        "What does 'closing a ticket' mean?",
        "What are FAQs, and why are they important in customer service?"
      ],
      "Pool3": [
        "Tell me about a time you handled a polite but confused person.",
        "Describe a moment when you helped a customer who was new or unfamiliar with the product.",
        "Tell me about a situation where you had to apologise to a customer.",
        "Describe how you handled a customer who asked many repeated questions.",
        "Tell me about a time you explained a technical feature in simple terms.",
        "Describe a moment when you calmed down a slightly irritated customer.",
        "Tell me about a time when you handled a queue of customers efficiently.",
        "Describe a situation where a customer misunderstood you. How did you fix it?",
        "Tell me about a moment when you solved a small issue that made a big impact for the customer.",
        "Describe how you handled a customer who kept changing their mind."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Describe a time you went out of your way to help a customer.",
        "How do you handle a situation where a customer keeps interrupting you?",
        "Tell me about a time you managed an angry or frustrated customer successfully.",
        "How do you take responsibility when a customer issue escalates?",
        "Describe how you balance empathy with company policies.",
        "How do you maintain professionalism when a customer is unreasonable?",
        "Tell me about a time you mediated a conflict between two customers or team members.",
        "Describe how you handle situations where customers demand unrealistic solutions.",
        "What do you do when your team is overwhelmed and you must take initiative?",
        "How do you stay resilient during long hours of customer interaction?"
      ],
      "Pool2": [
        "How do you use CRM tools like Zendesk, Freshdesk, or Salesforce?",
        "What KPIs do you think are most important in customer service?",
        "How do you identify when an issue requires escalation?",
        "What is the difference between Tier 1 and Tier 2 support?",
        "How do you handle SLAs (Service Level Agreements)?",
        "Describe how you diagnose recurring customer issues using data.",
        "How do you collaborate with product or technical teams to solve complex issues?",
        "What steps do you take to improve customer satisfaction scores (CSAT)?",
        "How do you measure and respond to customer feedback trends?",
        "Explain how you manage multiple tickets at once without compromising quality."
      ],
      "Pool3": [
        "Tell me about the most difficult customer you’ve ever handled. What was the outcome?",
        "Describe a time when a customer issue was unresolved for a long time. How did you take ownership?",
        "Tell me about a situation where you had to deliver bad news to a customer.",
        "Describe a moment when a customer blamed you for something out of your control.",
        "Tell me about a situation where you handled a customer’s anger professionally and successfully.",
        "Describe a case where you coordinated with multiple teams to solve a complex problem.",
        "Tell me about a moment when a customer demanded something against company policy. What did you do?",
        "Describe how you handled a situation where multiple customers were upset at the same time.",
        "Tell me about a scenario where your solution prevented an escalation.",
        "Describe a customer service case where your actions significantly improved customer loyalty or retention."
      ]
    }
  },
  "Teacher": {
    "Basic": {
      "Pool1": [
        "What inspired you to teach your subject, and how do you keep your passion alive?",
        "How do you ensure students understand the fundamentals of your subject?",
        "What steps do you take to simplify complex concepts in your subject area?",
        "How do you handle students who show no interest in your subject?",
        "How do you stay updated with new trends or developments in your teaching field?",
        "How do you respond when a student challenges your explanation of a subject concept?",
        "What is your approach to handling diverse learning speeds in your subject-based classes?",
        "How do you incorporate real-life examples from your subject area to make learning engaging?",
        "What do you do to build confidence in students who struggle in your subject?",
        "How do you evaluate your effectiveness in teaching your subject?"
      ],
      "Pool2": [
        "Tell me about a time you helped a struggling student understand a difficult topic.",
        "Describe a classroom situation where your explanation didn’t work. What did you do next?",
        "Tell me about a moment you handled a disruptive student without affecting the class flow.",
        "Describe a time you used an unconventional method to teach a topic.",
        "Tell me about a class where students were losing interest. How did you re-engage them?",
        "Describe a time you had to manage a large class while ensuring everyone understood the lesson.",
        "Tell me about a class activity that worked exceptionally well. Why was it effective?",
        "Describe a situation where a student misunderstood a concept because of your teaching. How did you fix it?",
        "Tell me about a lesson plan you changed at the last minute. Why and how?",
        "Describe a difficult teaching day and how you maintained your professionalism."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you integrate your research interests into your teaching practice?",
        "Describe how your subject expertise and research background complement one another.",
        "How do you encourage students to think beyond textbooks and into inquiry or research?",
        "What motivates you to pursue research alongside teaching?",
        "How do you ensure your teaching reflects the latest research in your field?",
        "Describe a time your research experience improved your classroom delivery.",
        "What is your approach to balancing teaching workload with research commitments?",
        "How do you respond when your research findings contradict existing curriculum content?",
        "What steps do you take to build academic curiosity in students?",
        "How do you mentor students who show interest in research?"
      ],
      "Pool2": [
        "Tell me about a time your research experience helped you solve a classroom challenge.",
        "Describe a situation where you guided a student through a research or project-based assignment.",
        "Tell me about a conflict between academic requirements and new research evidence.",
        "Describe how you handled a student group that struggled with analytical or research skills.",
        "Tell me about a time you incorporated a recent research paper into your teaching.",
        "Describe a situation where your research faced setbacks but you still had teaching responsibilities.",
        "Tell me about a time you supervised an academic project or presentation effectively.",
        "Describe a time you encouraged students to question a concept using a research mindset.",
        "Tell me about a classroom discussion where your research background enriched the learning experience.",
        "Describe a moment you identified a research opportunity from your teaching environment."
      ]
    }
  },
  "Work From Home Jobs": {
    "Basic": {
      "Pool1": [
        "What in your education or training has prepared you for this role?",
        "How do you handle situations where things don’t go as planned?",
        "What motivates you to keep going when results are slow or unclear?",
        "How do you respond to constructive criticism?",
        "What does professionalism mean to you in a workplace?",
        "How do you maintain a positive attitude during stressful situations?",
        "What kind of work environment helps you perform at your best, and why?",
        "How do you approach tasks that you find challenging or unfamiliar?",
        "What does success mean to you at the beginning of your career?",
        "How do you take responsibility for your mistakes?"
      ],
      "Pool2": [
        "How do you ensure your communication is clear and professional in interviews or meetings?",
        "How do you adjust your communication style when speaking to seniors, peers, or clients?",
        "Can you explain a complex idea in simple words?",
        "How do you make sure you are actively listening during conversations?",
        "What steps do you take to improve your pronunciation or clarity while speaking?",
        "How do you approach learning a new skill or concept quickly?",
        "What is one skill you are currently working on improving, and how?",
        "How do you apply feedback to improve your performance?",
        "How do you stay updated with industry trends or job requirements?",
        "How do you balance accuracy and fluency while speaking English?",
        "How did you tailor your resume or LinkedIn profile for the role you are applying for?",
        "How would you introduce yourself professionally in under one minute?",
        "How do you prepare before presenting your ideas to others?",
        "How do you decide what information to include or exclude in a resume or cover letter?",
        "How have you used AI tools responsibly to support your job search or preparation?",
        "How do you handle nervousness while speaking in professional settings?",
        "What non-verbal behaviors help create a good first impression?",
        "How do you ensure professional etiquette in virtual or in-person interactions?",
        "How do you structure your answers to sound confident and relevant in interviews?",
        "What habits help you continuously improve as a learner and job seeker?"
      ],
      "Pool3": [
        "Give an example of a time you faced a difficult challenge. What did you do about it?",
        "Tell me about a time you made a mistake. How did you handle it?",
        "Describe a situation where you had to learn something quickly.",
        "Tell me about a time you worked with someone very different from you.",
        "Describe a situation where you had to manage pressure or deadlines.",
        "Share an experience where you received feedback you didn’t initially agree with.",
        "Tell me about a time you showed initiative without being asked.",
        "Describe a situation where communication played a key role in success or failure.",
        "Tell me about a time you had to explain something clearly to others.",
        "Describe a situation where you stayed motivated despite setbacks."
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your education or training has prepared you for this role?",
        "How do you handle situations where things don’t go as planned?",
        "What motivates you to keep going when results are slow or unclear?",
        "How do you respond to constructive criticism?",
        "What does professionalism mean to you in a workplace?",
        "How do you maintain a positive attitude during stressful situations?",
        "What kind of work environment helps you perform at your best, and why?",
        "How do you approach tasks that you find challenging or unfamiliar?",
        "What does success mean to you at the beginning of your career?",
        "How do you take responsibility for your mistakes?"
      ],
      "Pool2": [
        "How do you ensure your communication is clear and professional in interviews or meetings?",
        "How do you adjust your communication style when speaking to seniors, peers, or clients?",
        "Can you explain a complex idea in simple words?",
        "How do you make sure you are actively listening during conversations?",
        "What steps do you take to improve your pronunciation or clarity while speaking?",
        "How do you approach learning a new skill or concept quickly?",
        "What is one skill you are currently working on improving, and how?",
        "How do you apply feedback to improve your performance?",
        "How do you stay updated with industry trends or job requirements?",
        "How do you balance accuracy and fluency while speaking English?",
        "How did you tailor your resume or LinkedIn profile for the role you are applying for?",
        "How would you introduce yourself professionally in under one minute?",
        "How do you prepare before presenting your ideas to others?",
        "How do you decide what information to include or exclude in a resume or cover letter?",
        "How have you used AI tools responsibly to support your job search or preparation?",
        "How do you handle nervousness while speaking in professional settings?",
        "What non-verbal behaviors help create a good first impression?",
        "How do you ensure professional etiquette in virtual or in-person interactions?",
        "How do you structure your answers to sound confident and relevant in interviews?",
        "What habits help you continuously improve as a learner and job seeker?"
      ],
      "Pool3": [
        "Give an example of a time you faced a difficult challenge. What did you do about it?",
        "Tell me about a time you made a mistake. How did you handle it?",
        "Describe a situation where you had to learn something quickly.",
        "Tell me about a time you worked with someone very different from you.",
        "Describe a situation where you had to manage pressure or deadlines.",
        "Share an experience where you received feedback you didn’t initially agree with.",
        "Tell me about a time you showed initiative without being asked.",
        "Describe a situation where communication played a key role in success or failure.",
        "Tell me about a time you had to explain something clearly to others.",
        "Describe a situation where you stayed motivated despite setbacks."
      ]
    }
  },
  "Entrepreneur": {
    "Basic": {
      "Pool1": [
        "What inspired you to consider entrepreneurship in the first place?",
        "What was the earliest business idea you ever thought of?",
        "How did your background or upbringing influence your interest in entrepreneurship?",
        "What challenges did you face in your earliest entrepreneurial attempts?",
        "How did you identify your first opportunity or idea?",
        "What do you think are the basic qualities needed to begin an entrepreneurial journey?",
        "What is one small initiative you started (school, college, community)?",
        "How do you approach risk when thinking about new ideas?",
        "What motivates you to take ownership and create something of your own?"
      ],
      "Pool2": [
        "How do you validate an idea before investing time or money into it?",
        "What steps do you take to understand customer needs?",
        "How do you manage your time when working on an idea?",
        "Describe how you handle uncertainty in early-stage decisions.",
        "How do you set short-term goals for your entrepreneurial projects?",
        "What role does personal discipline play in your entrepreneurial work?",
        "How do you ensure that your idea remains feasible?",
        "What is your approach to learning skills you don’t yet have?",
        "How do you build basic relationships or networks to support your ideas?",
        "How do you measure early progress in a project or idea?"
      ],
      "Pool3": [
        "Describe a time you tried to start something and faced an obstacle. What did you do?",
        "Tell me about a moment when someone criticised your idea. How did you handle it?",
        "Describe how you convinced someone to support your idea or initiative.",
        "Tell me about a time when your plan didn’t go as expected.",
        "Describe how you handled limited resources for an idea.",
        "Tell me about a decision you made quickly with limited information.",
        "Describe a time you collaborated with someone to build something small.",
        "Tell me about a moment when you changed direction because your idea wasn’t working.",
        "Describe how you handled rejection from a customer, partner, or mentor.",
        "Tell me about a time when you took initiative even when others did not."
      ]
    },
    "Advanced": {
      "Pool1": [
        "What long-term entrepreneurial initiatives have you led or co-founded?",
        "How has your entrepreneurial journey shaped your leadership style?",
        "What patterns have you observed in your entrepreneurial attempts over time?",
        "How do you identify gaps in the market at a strategic level?",
        "Describe how your entrepreneurial mindset has evolved through failures.",
        "What industries or sectors have you explored deeply, and why?",
        "How do you balance multiple entrepreneurial ideas or ventures at once?",
        "What personal strengths have consistently helped you in entrepreneurship?",
        "How do you evaluate whether an opportunity aligns with your long-term vision?",
        "How has entrepreneurship influenced your understanding of risk, growth, and resilience?"
      ],
      "Pool2": [
        "How do you build and validate a minimum viable product (MVP)?",
        "Describe your approach to building and managing a team for your venture.",
        "How do you analyse financial feasibility and cash flow needs?",
        "How do you acquire your first customers or early adopters?",
        "Describe how you pivoted from an initial idea to something more viable.",
        "What strategies do you use to scale a product or business model?",
        "How do you create and refine your value proposition?",
        "What frameworks do you use for decision-making under uncertainty?",
        "How do you manage partnerships, vendors, or early-stage investors?",
        "What systems do you put in place to measure performance in a venture?"
      ],
      "Pool3": [
        "Tell me about the most challenging entrepreneurial problem you solved. What was your process?",
        "Describe a moment when your team disagreed with your vision. How did you handle it?",
        "Tell me about a situation where you had to make a major pivot to save a venture.",
        "Describe a crisis where you had to take immediate action to prevent loss.",
        "Tell me about a time when external factors (market shift, competitor move) forced you to rethink strategy.",
        "Describe a situation where you had to pitch to skeptical investors or stakeholders.",
        "Tell me about a time your cash flow dropped unexpectedly. What decisions did you make?",
        "Describe how you handled a co-founder conflict or team breakdown.",
        "Tell me about a high-stakes decision you made with very limited time.",
        "Describe a moment you realised your venture’s vision needed to change long-term."
      ]
    }
  },
  "Lawyer": {
    "Basic": {
      "Pool1": [
        "What motivated you to choose law as a profession?",
        "Which areas of law have you been exposed to during your education or training?",
        "What was your first real experience with legal work (internship, moot, casework)?",
        "How did your legal education shape your way of thinking?",
        "What type of legal work interests you the most and why?",
        "Describe a law subject you found most engaging during your studies.",
        "What role did internships or clerkships play in your legal learning?",
        "How comfortable are you with reading and interpreting statutes or judgments?",
        "What do you believe is the primary responsibility of a lawyer?",
        "How has your background influenced your approach to legal practice?"
      ],
      "Pool2": [
        "How do you approach understanding a new legal problem or case?",
        "What steps do you take to research a legal issue?",
        "How do you ensure accuracy while drafting legal documents?",
        "What role does ethics play in your decision-making as a lawyer?",
        "How do you manage multiple cases or assignments at the same time?",
        "How do you explain legal concepts to clients with no legal background?",
        "What do you do when you are unsure about a legal interpretation?",
        "How do you keep yourself updated with changes in laws or judgments?",
        "What skills do you think are essential for a lawyer at the beginning of their career?",
        "How do you handle pressure when deadlines or hearings are close?"
      ],
      "Pool3": [
        "Tell me about a time you struggled to understand a legal concept. How did you overcome it?",
        "Describe a situation where your legal research initially led you in the wrong direction.",
        "Tell me about a time you received critical feedback on your drafting or argument.",
        "Describe a situation where you had to balance academic workload with legal training.",
        "Tell me about a moment when you observed unethical behaviour. How did you respond?",
        "Describe a situation where you had to work with someone who disagreed with your legal view.",
        "Tell me about a time you prepared for a moot, trial, or hearing under time pressure.",
        "Describe a situation where attention to detail helped you avoid a mistake.",
        "Tell me about a time you assisted a senior lawyer or professor on a legal task.",
        "Describe a moment when you realised law requires patience and discipline."
      ]
    },
    "Advanced": {
      "Pool1": [
        "What areas of law have you practised extensively, and why did you choose them?",
        "How has your legal practice evolved since you started your career?",
        "What types of clients or matters have shaped you most as a lawyer?",
        "Describe how your courtroom or transactional experience has influenced your legal thinking.",
        "What patterns have you observed in successful legal strategies over time?",
        "How do you evaluate whether a case or matter is worth pursuing?",
        "How has your understanding of justice changed with real-world practice?",
        "What professional values guide your long-term legal career?",
        "How do you balance client interests with legal and ethical boundaries?",
        "How has your experience changed your approach to legal risk?"
      ],
      "Pool2": [
        "How do you structure legal arguments for complex cases?",
        "Describe your approach to interpreting conflicting statutes or precedents.",
        "How do you assess legal risk for clients before advising them?",
        "What strategies do you use while drafting contracts, pleadings, or opinions?",
        "How do you handle situations where law and client expectations conflict?",
        "Describe how you prepare for high-stakes hearings or negotiations.",
        "How do you mentor juniors or guide interns in legal reasoning?",
        "What frameworks do you use for decision-making in legally ambiguous situations?",
        "How do you manage client relationships during long or difficult cases?",
        "How do you measure success in your legal practice?"
      ],
      "Pool3": [
        "Tell me about the most challenging case or legal matter you handled.",
        "Describe a situation where a client insisted on an unethical or illegal course of action.",
        "Tell me about a time when a case took an unexpected turn. How did you adapt?",
        "Describe a moment where your legal judgment prevented a serious risk.",
        "Tell me about a conflict with opposing counsel or within your legal team.",
        "Describe a situation where you had to make a decision with incomplete legal clarity.",
        "Tell me about a time when external pressure tried to influence your legal stance.",
        "Describe how you handled a case loss or unfavourable judgment.",
        "Tell me about a high-stakes negotiation you were involved in.",
        "Describe a situation where your legal advice had a significant real-world impact."
      ]
    }
  },
  "Cabin Crew": {
    "Basic": {
      "Pool1": [
        "Why you want to become a cabin crew member?",
        "What motivates you to work in the aviation and cabin crew industry?",
        "What three personal strengths make you a great fit for a cabin crew role?",
        "What do you think are the most important qualities of a successful cabin crew member?",
        "How would your friends or previous managers describe your attitude at work?",
        "What do you believe customer service means in the context of a flight?",
        "Why should the airline hire you over other candidates?",
        "How do you stay calm and composed under pressure?",
        "What does teamwork mean to you and why is it important onboard?",
        "How do you handle stressful or fast-paced work environments?",
        "What is your approach to learning and adapting to new procedures?",
        "How do you stay motivated during long flights and irregular schedules?",
        "What does excellent customer service look like to you?",
        "How do you balance safety priorities with passenger comfort?"
      ],
      "Pool2": [
        "How do you maintain your grooming standards on a daily basis?",
        "Why do grooming standards matter for cabin crew?",
        "What is your daily grooming routine before a flight?",
        "What would you do if your uniform was damaged before a flight?",
        "How do you maintain a polished and professional appearance during long duty hours?",
        "How do you ensure your hair, makeup, and accessories comply with airline policies?",
        "What do airline grooming standards communicate to customers?",
        "How does your appearance affect the passenger’s first impression?",
        "Describe a time when you received feedback about your appearance. How did you respond?",
        "What does ‘professional presence’ mean to you?",
        "How do you handle personal grooming when working consecutive flights?",
        "Have you ever had to adjust your grooming or appearance to fit a company’s standard? What did you learn?",
        "How would you maintain grooming discipline during early morning or late-night flights?",
        "Why is personal presentation especially critical in customer-facing roles like cabin crew?",
        "How do you balance cultural or personal style with strict airline grooming requirements?"
      ],
      "Pool3": [
        "What are the main responsibilities of a cabin crew member?",
        "What do you know about our airline—its destinations, fleet or service standards?",
        "What do you think are the biggest challenges airlines face today?",
        "How would you define good customer service in an airline context?",
        "Why is safety the top priority in aviation?",
        "How do airlines handle in-flight medical emergencies?",
        "What items are passengers not allowed to carry onboard?",
        "How would you describe the importance of cultural sensitivity in a cabin crew role?",
        "What steps do cabin crew take during an emergency evacuation?",
        "How would you ensure passenger safety during turbulence?",
        "What language skills can help you as cabin crew?",
        "Explain how cabin crew maintain safety during take-off and landing.",
        "Why is it important to know your airline’s safety procedures thoroughly?",
        "What is the role of cabin crew in customer complaint resolution?",
        "How do airlines train cabin crew for emergency scenarios?",
        "How does teamwork contribute to flight safety?",
        "How would you promote the airline’s brand during service?",
        "What trends in customer service are shaping the aviation industry today?",
        "How would you handle cultural differences and diverse passenger needs?",
        "How would you handle competing priorities during service (e.g., safety vs. service timing)?"
      ],
      "Pool4": [
        "How would you handle a rude or aggressive passenger?",
        "Describe what you would do if two passengers are arguing mid-flight.",
        "How would you help a fearful passenger during turbulence?",
        "What would you do if you saw a colleague not following safety procedures?",
        "How would you react if you were asked to work a long shift with little rest?",
        "How would you deal with a passenger who refuses to follow safety instructions?",
        "What would you do if a passenger complained about their meal?",
        "How would you manage a medical emergency when no doctor is on board?",
        "Describe how you would calm a child having a panic attack mid-flight.",
        "What would you do if you lost important documents en route to a flight?",
        "How would you respond to a major delay and frustrated passengers?",
        "What steps would you take if baggage was misplaced on your aircraft?",
        "How would you handle working with a team member you don’t get along with?",
        "If a passenger becomes ill and refuses help, what would you do?",
        "How would you prioritise tasks during peak boarding time?",
        "What would you do if a suspicious item was found on board?",
        "How would you reassure passengers during unexpected turbulence?",
        "What would you do if a language barrier made communication difficult?",
        "How would you manage your responsibilities during a long overnight flight?",
        "What would you do if an unexpected service disruption happened mid-flight?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "Why did you choose this profession originally, and how has your motivation evolved over the time?",
        "What personal qualities do you think have helped you become a stronger cabin crew member over time?",
        "How do you maintain a positive attitude when flying long hours and irregular schedules?",
        "What does leadership mean to you in the context of a multi-national cabin crew team?",
        "How would your colleagues describe your work ethic and attitude?",
        "What steps do you take to foster a strong team culture on board?",
        "How do you ensure you remain calm and professional in high-pressure situations?",
        "Why is empathy important for cabin crew, and how do you practise it daily?",
        "How do you balance customer expectations with company policy?",
        "What role should a senior cabin crew member play in mentoring new recruits?",
        "How do you deal with personal stress and burnout in a demanding airline environment?",
        "How do you handle criticism from supervisors or colleagues?",
        "What does \"going the extra mile\" mean to you in terms of passenger service?",
        "How do you adapt when airline procedures or standards change unexpectedly?",
        "What aspiration do you have for your career beyond the cabin crew position?"
      ],
      "Pool2": [
        "How do you consistently maintain airline-standard grooming and uniform presentation on back-to-back flights?",
        "What is your daily grooming routine when you are on consecutive flights?",
        "How do you ensure your appearance reflects the airline’s brand values at all times?",
        "How would you handle a grooming situation that might not meet policy before a flight?",
        "What grooming standards do you think are most important for senior cabin crew?",
        "How do you balance personal style with strict airline grooming requirements?",
        "How do you adapt your grooming when duty schedules affect sleep or meal patterns?",
        "Why do grooming standards matter more for public-facing roles like cabin crew?",
        "How do you handle grooming requests or corrections from senior leadership?",
        "Describe a time when grooming discipline positively impacted customer perception.",
        "What tips do you give to new crew members about maintaining professional presence?",
        "How does grooming help you assert authority and influence within the cabin team?",
        "How do you adjust your grooming standards in different cultural or in-flight environments?",
        "What does “professional presence” mean to you as an experienced crew member?",
        "How do you coach less experienced crew about grooming expectations?"
      ],
      "Pool3": [
        "Describe in detail the safety procedures you follow during pre-flight briefing and cabin checks.",
        "Explain your airline’s emergency evacuation protocols and your role in them.",
        "How do you handle a medical emergency on board when there is no doctor present?",
        "What advanced customer service techniques have you developed with experience?",
        "How do you manage cabin service differences between economy, premium economy, and business/first class?",
        "Explain how you contribute to inflight sales or ancillary revenue (if applicable).",
        "What measures do you take to ensure passenger comfort on long-haul flights?",
        "How do you coach new crew on standard operating procedures (SOPs)?",
        "What systems or checklists do you use for inflight quality assurance?",
        "How do you handle international diversity among passengers?",
        "How do you use safety announcements to engage passengers effectively?",
        "How do airline service standards differ between carriers, and how do you adapt?",
        "What is the role of cabin crew in post-incident debriefs?",
        "Describe how you maintain alertness and performance during night flights.",
        "How do you ensure food and beverage safety during service?",
        "Explain how you deal with in-flight documentation and reports.",
        "What trends are shaping customer expectations in the airline industry today?",
        "How do you use feedback from passengers to improve service?",
        "What languages or cross-cultural skills help you perform better in international flights?",
        "How do you support inflight promotions, brand campaigns, or special service initiatives?"
      ],
      "Pool4": [
        "Describe a time when you had to handle a rude or disruptive passenger and de-escalate the situation.",
        "What would you do if a senior crew member gave you conflicting instructions mid-flight?",
        "How would you manage multiple simultaneous emergencies, Medical or security?",
        "Describe a situation where you had to make a tough judgment call without direct supervision.",
        "How would you handle a passenger who refuses to follow safety instructions?",
        "What would you do if a passenger complained about discriminatory treatment?",
        "Describe how you would assist colleagues during a long-haul flight with limited rest breaks.",
        "How do you adapt customer service when the flight is delayed for many hours?",
        "Describe your approach if a passenger becomes ill and demands special treatment.",
        "What steps would you take if you realized a trainee had missed an important safety step?",
        "How would you handle language barriers in critical communication?",
        "What would you do if you noticed food safety issues during service?",
        "How would you respond to a report of a lost item in flight?",
        "Describe how you would support a nervous passenger during turbulence.",
        "What would you do if a colleague called in sick and the cabin was understaffed?",
        "How would you communicate bad news to cabin passengers (e.g., flight cancellation)?",
        "Describe a time when you faced conflicting priorities during service.",
        "How would you reassure passengers during an unexpected diversion?",
        "What would you do if crew rest areas were unavailable on a long flight?",
        "Describe how you would lead a post-flight debrief after a challenging trip."
      ]
    }
  },"Human Resource Management": {
    "Basic": {
      "Pool1": [
        "What motivated you to choose Human Resource Management as a career?",
        "Which HR functions have you been exposed to so far (recruitment, payroll, training, etc.)?",
        "What was your first hands-on experience related to HR work?",
        "How did your education or training prepare you for an HR role?",
        "Which area of HR interests you the most and why?",
        "What do you believe is the primary role of HR in an organisation?",
        "How comfortable are you working with people-related issues?",
        "What skills from your background are most useful for HR work?",
        "How do you see HR contributing to organisational success?",
        "What expectations do you have from an HR manager role?"
      ],
      "Pool2": [
        "How do you handle confidential employee information?",
        "What steps do you follow during a recruitment process?",
        "How do you ensure fairness during interviews or evaluations?",
        "How do you manage multiple HR tasks at the same time?",
        "What role does communication play in HR effectiveness?",
        "How do you explain HR policies to employees clearly?",
        "What do you understand by employee engagement?",
        "How do you handle employee queries or concerns?",
        "What HR tools or systems are you familiar with?",
        "What qualities are essential for an effective HR manager?"
      ],
      "Pool3": [
        "Tell me about a time you resolved a small conflict between colleagues.",
        "Describe a situation where an employee approached you with a concern.",
        "Tell me about a time you had to maintain confidentiality under pressure.",
        "Describe how you handled an employee who was unhappy with a decision.",
        "Tell me about a time you had to communicate an unpopular policy.",
        "Describe a situation where you managed multiple HR priorities at once.",
        "Tell me about a time you supported a new employee during onboarding.",
        "Describe how you handled a misunderstanding between management and staff.",
        "Tell me about a situation where empathy was crucial in your role.",
        "Describe a moment when you had to remain neutral in a people-related issue."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How has your HR role evolved as you gained experience?",
        "What types of organisations or industries have shaped your HR approach?",
        "How has handling employee relations influenced your leadership style?",
        "What HR initiatives have you led or significantly contributed to?",
        "How do you align HR practices with business goals?",
        "What patterns have you observed in successful HR strategies?",
        "How do you balance employee advocacy with organisational needs?",
        "What professional values guide your HR decisions?",
        "How has your experience changed your approach to workforce planning?",
        "What long-term impact do you aim to create as an HR manager?"
      ],
      "Pool2": [
        "How do you design and implement an effective performance management system?",
        "Describe your approach to handling disciplinary issues.",
        "How do you ensure compliance with labour laws and regulations?",
        "How do you use HR metrics and analytics for decision-making?",
        "Describe your strategy for talent retention and succession planning.",
        "How do you manage change during organisational restructuring?",
        "How do you address workplace diversity, equity, and inclusion?",
        "What steps do you take to improve employee engagement and morale?",
        "How do you handle conflicts between senior management and employees?",
        "How do you evaluate the effectiveness of HR policies and programs?"
      ],
      "Pool3": [
        "Tell me about a difficult employee relations case you handled.",
        "Describe a situation where you had to terminate an employee. How did you manage it?",
        "Tell me about a time when HR had to take an unpopular but necessary decision.",
        "Describe how you handled a serious workplace conflict or grievance.",
        "Tell me about a situation where you advised leadership against a risky decision.",
        "Describe a time when confidentiality and ethics were severely tested.",
        "Tell me about a major change initiative you supported or led.",
        "Describe a scenario where HR intervention prevented legal or reputational risk.",
        "Tell me about a time you balanced compassion with policy enforcement.",
        "Describe an HR decision that had a significant positive impact on the organisation."
      ]
    }
  }, "Quality Control and Quality Assurance": {
    "Basic": {
      "Pool1": [
        "What motivated you to pursue Quality Control or Quality Assurance?",
        "Which subjects in your degree are most relevant to QC or QA work? How?",
        "What kind of laboratory exposure did you have during your studies?",
        "How were quality, accuracy, and documentation emphasized in your practical classes?",
        "What do you understand by Quality Control and Quality Assurance?",
        "What role do you think a chemistry graduate plays in maintaining product quality?",
        "Have you been exposed to SOPs or standard lab documentation?",
        "What types of chemical analyses are you familiar with from your coursework?",
        "How has your academic background prepared you for working in regulated environments?",
        "Why do you think QC/QA roles require strong attention to detail?"
      ],
      "Pool2": [
        "How do you ensure accuracy and precision while performing laboratory tests?",
        "What safety practices do you follow while working in a lab?",
        "How do you document test results and observations?",
        "What do you understand by Good Laboratory Practices (GLP)?",
        "How do you handle samples to avoid contamination or mix-ups?",
        "What basic analytical instruments are you comfortable using?",
        "How do you prepare and standardize solutions accurately?",
        "What steps do you follow when an experiment does not give expected results?",
        "How do you manage multiple samples or tests within a deadline?",
        "What qualities are essential for someone working in QC or QA?"
      ],
      "Pool3": [
        "Tell me about a time you made an error in the lab. How did you correct it?",
        "Describe a situation where accuracy was critical in your work.",
        "Tell me about a time you strictly followed lab rules or protocols.",
        "Describe how you handled limited time while ensuring quality.",
        "Tell me about a situation where you had to repeat an analysis.",
        "Describe a time you noticed a deviation during an experiment.",
        "Tell me about a moment when documentation was especially important.",
        "Describe how you handled pressure during practical exams or lab submissions.",
        "Tell me about a time you worked as part of a quality-focused team.",
        "Describe how you ensured reliability of results in your practical work."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you differentiate the responsibilities of QC and QA in an organization?",
        "How does analytical chemistry support quality control decisions?",
        "What exposure do you have to pharmaceutical or industrial quality systems?",
        "How do you relate your chemistry knowledge to regulatory compliance?",
        "What do you understand by GMP and its importance in QC/QA?",
        "How do quality systems impact product safety and consumer trust?",
        "What gaps do you see between academic labs and industrial QC labs?",
        "How have your academic projects prepared you for QC/QA roles?",
        "What long-term role do you see for yourself in quality management?",
        "How does quality assurance contribute to continuous improvement?"
      ],
      "Pool2": [
        "Explain the importance of SOPs in QC and QA.",
        "How do you handle out-of-specification (OOS) results?",
        "What is the role of documentation in ensuring data integrity?",
        "How do you ensure traceability of samples and results?",
        "Explain the difference between validation and calibration.",
        "How do audits support quality assurance?",
        "What steps would you take to investigate a deviation?",
        "How does risk assessment apply to QC/QA decisions?",
        "What role does chemistry play in stability testing?",
        "How do you ensure compliance without compromising efficiency?"
      ],
      "Pool3": [
        "Tell me about a situation where you identified a potential quality issue early.",
        "Describe how you would handle an OOS result under time pressure.",
        "Tell me about a time you had to strictly follow documentation despite delays.",
        "Describe a situation where someone asked you to ignore a minor deviation.",
        "Tell me about a moment where quality rules conflicted with speed.",
        "Describe how you would respond during a regulatory audit.",
        "Tell me about a time data accuracy was more important than convenience.",
        "Describe a scenario where poor documentation caused issues.",
        "Tell me about a time you learned from a quality failure.",
        "Describe how you handle pressure in a highly regulated QC/QA environment."
      ]
    }
  },"Pharmaceuticals": {
    "Basic": {
      "Pool1": [
        "What motivated you to consider a career in pharmaceuticals?",
        "Which chemistry subjects from your degree are most relevant to the pharma industry?",
        "What laboratory techniques did you frequently use during your coursework?",
        "Describe a chemistry experiment you found particularly interesting or challenging.",
        "How did your academic curriculum introduce you to pharmaceutical applications of chemistry?",
        "What kind of practical or industrial exposure have you had so far (projects, internships, visits)?",
        "Which area of pharma work interests you the most—QA, QC, R&D, or production—and why?",
        "How comfortable are you with handling chemicals, instruments, and lab documentation?",
        "What role do you think a chemistry graduate plays in the pharmaceutical industry?",
        "How has your education prepared you for working in a regulated industry like pharma?"
      ],
      "Pool2": [
        "How do you ensure accuracy while performing chemical experiments or analyses?",
        "What steps do you follow to maintain safety in a laboratory environment?",
        "How do you record observations and results during experiments?",
        "What do you understand by Good Laboratory Practices (GLP)?",
        "How do you handle situations where experimental results do not match expectations?",
        "What basic analytical instruments are you familiar with (e.g., UV–Vis, pH meter, balance)?",
        "How do you prepare solutions, reagents, or buffers accurately?",
        "What is your approach to learning a new analytical method or SOP?",
        "How do you manage time when multiple experiments or tasks are assigned?",
        "What basic quality checks are important in pharmaceutical laboratories?"
      ],
      "Pool3": [
        "Tell me about a time an experiment failed. What did you do next?",
        "Describe a situation where you had to repeat an experiment due to an error.",
        "Tell me about a time you followed strict lab rules or protocols.",
        "Describe how you handled limited resources or equipment in a lab.",
        "Tell me about a situation where accuracy was critical in your work.",
        "Describe a moment when you had to work long hours in the lab.",
        "Tell me about a time you learned a new instrument or technique quickly.",
        "Describe a situation where you identified a mistake before it caused a problem.",
        "Tell me about a time you worked as part of a lab team.",
        "Describe how you handled academic pressure during practical examinations or projects."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you see your chemistry background fitting into pharmaceutical manufacturing or R&D?",
        "What exposure do you have to pharmaceutical formulations or drug analysis?",
        "How has your understanding of organic/inorganic/physical chemistry evolved toward applications?",
        "What pharmaceutical processes are you most curious to learn in depth?",
        "How do you relate reaction mechanisms to drug synthesis or impurity formation?",
        "What role does analytical chemistry play in ensuring drug quality and safety?",
        "How familiar are you with regulatory concepts like GMP or validation?",
        "What gaps do you see between academic chemistry and pharma industry requirements?",
        "How have your projects or dissertations prepared you for pharma roles?",
        "What long-term role do you envision for yourself in the pharmaceutical sector?"
      ],
      "Pool2": [
        "Explain the importance of documentation in pharmaceutical laboratories.",
        "How do you ensure compliance with SOPs and regulatory requirements?",
        "Describe how analytical chemistry supports quality control in pharma.",
        "What steps would you take to investigate out-of-specification (OOS) results?",
        "How do you differentiate between accuracy, precision, and reproducibility?",
        "What role does chemistry play in stability studies of drugs?",
        "How do you ensure contamination control in pharmaceutical environments?",
        "Explain how method validation is important in drug analysis.",
        "How do you approach problem-solving when results are inconsistent?",
        "What quality mindset should a chemistry graduate develop for pharma work?"
      ],
      "Pool3": [
        "Tell me about a situation where your attention to detail prevented a major issue.",
        "Describe a time you had to strictly follow documentation or SOPs.",
        "Tell me about a scenario where an experiment result was out of specification. What would you do?",
        "Describe a situation where safety rules slowed work. How did you handle it?",
        "Tell me about a time you had to report a mistake or deviation.",
        "Describe how you would respond if a senior asked you to ignore a minor protocol.",
        "Tell me about a time you worked under strict deadlines with high accuracy expectations.",
        "Describe a situation where data integrity was critical.",
        "Tell me about a time you learned from a quality failure.",
        "Describe how you would handle pressure in a regulated pharmaceutical environment."
      ]
    }
  },
  "General": {
    "Basic": {
      "Pool1": [
        "What in your education or background has prepared you for professional work?",
        "What motivates you to apply for jobs at this stage of your career?",
        "How do you stay organised when handling multiple tasks?",
        "Describe how you learn new skills or tools.",
        "How do you handle situations where instructions aren’t clear?",
        "What do you do when you face a problem you don’t immediately know how to solve?",
        "How do you stay productive on days when you feel low or distracted?",
        "How do you respond when someone corrects you or gives feedback?",
        "What steps do you take to manage your time effectively?",
        "How do you ensure you communicate clearly with others?"
      ],
      "Pool2": [
        "What are professional ethics, and why are they important?",
        "How do you collaborate effectively in a team?",
        "What is the purpose of documentation in any job?",
        "What basic digital tools are you comfortable using (e.g., email, spreadsheets)?",
        "Why is customer or stakeholder communication important?",
        "What does “problem-solving” mean to you?",
        "What is the difference between tasks, goals, and outcomes?",
        "How do you approach learning a new tool or software?",
        "What is the importance of deadlines in the workplace?",
        "How do you ensure your work meets basic quality standards?"
      ],
      "Pool3": [
        "Tell me about a time you worked with someone who had a different working style.",
        "Describe a moment when you received unclear instructions. What did you do?",
        "Tell me about a time you helped someone on your team.",
        "Describe a situation when you had to learn something quickly.",
        "Tell me about a moment when you handled a small mistake effectively.",
        "Describe a time you adjusted your communication style for someone.",
        "Tell me about a situation where you balanced multiple tasks at once.",
        "Describe a moment when you resolved a simple conflict or misunderstanding.",
        "Tell me about a time when you suggested a small improvement in your team or workflow.",
        "Describe a situation where you had to meet a deadline with limited time."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Describe a time you took initiative even when it wasn’t expected.",
        "How do you handle situations where colleagues disagree with your approach?",
        "Tell me about a time you overcame a major setback.",
        "How do you decide what to prioritise when everything feels urgent?",
        "Describe a moment when you influenced someone without formal authority.",
        "How do you stay calm and professional in stressful situations?",
        "Tell me about a time you took responsibility for a mistake.",
        "How do you ensure your decisions are fair and unbiased?",
        "Describe how you manage long-term goals alongside daily tasks.",
        "What do you do to maintain continuous improvement in your work style?"
      ],
      "Pool2": [
        "How do you analyse a problem before proposing a solution?",
        "Describe how you make data-driven decisions in your work.",
        "What steps do you take to plan a small project from start to finish?",
        "How do you handle documentation for complex tasks or projects?",
        "What strategies do you use to ensure long-term goals align with daily activities?",
        "How do you measure success or performance in your role?",
        "How do you handle cross-functional collaboration?",
        "What frameworks do you use to break down large problems into smaller parts?",
        "How do you track your progress on tasks and deliverables?",
        "What methods do you use to evaluate risks before making decisions?"
      ],
      "Pool3": [
        "Tell me about a major problem you solved that made a significant impact.",
        "Describe a time you handled a conflict between team members or stakeholders.",
        "Tell me about a situation where you had to make a difficult decision with limited information.",
        "Describe a moment when you managed an unexpected crisis professionally.",
        "Tell me about a time you took the lead during a challenging situation.",
        "Describe a situation where your analysis or judgment prevented a bigger issue.",
        "Tell me about a time you significantly improved a process or system.",
        "Describe a scenario where you had to push back against unrealistic expectations.",
        "Tell me about a time you handled a long-term project with many moving parts.",
        "Describe a situation where your work directly contributed to measurable success."
      ]
    }
  }
}