{
  "Frontend Developer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past learning experience has prepared you the most for a front-end role?",
        "What excites you the most about working as a front-end developer?",
        "How do you stay disciplined and consistent when working on long or repetitive UI tasks?",
        "Tell me about a moment when you realised coding was the right career path for you.",
        "How do you deal with frustration when a component doesn’t work after multiple attempts?",
        "Describe a situation where you had to learn a new tool or framework quickly. How did you approach it?"
      ],
      "Pool2": [
        "Describe the concrete steps you take to make an interface accessible (e.g., ARIA roles, keyboard flows, colour contrast). Why is this important?",
        "Explain the difference between class selectors, ID selectors, and attribute selectors in CSS. When should each be used?",
        "What is the DOM, and how does JavaScript interact with it?",
        "What is the difference between inline, inline-block, and block elements in HTML?",
        "Explain how flexbox works. When would you choose flexbox over grid?",
        "Describe how browser caching works for front-end assets.",
        "What are semantic HTML tags? Why do we use them?",
        "Explain how responsive design works. What tools or CSS properties help achieve it?",
        "How do you optimise images and static assets for faster page loading?"
      ],
      "Pool3": [
        "Tell me about the toughest front-end bug or integration challenge you solved recently—how did you diagnose it, and what was the outcome?",
        "Describe a time when you were asked to redesign or rebuild a component. How did you handle user feedback and technical constraints?",
        "Talk about a time when working with a backend API was difficult—what did you do to ensure the UI still functioned smoothly?",
        "Give an example of a time you faced a difficult challenge. What did you do about it?",
        "Describe a situation where you improved performance or reduced load time—what steps did you take?",
        "Tell me about a front-end feature you built that you’re most proud of. Why does it stand out?",
        "Describe a time when you had to work under a very tight deadline. What strategies helped you deliver?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you stay disciplined and consistent when working on long or repetitive UI tasks?",
        "Tell me about a moment when you realised coding was the right career path for you.",
        "How do you deal with frustration when a component doesn’t work after multiple attempts?",
        "Describe a situation where you had to learn a new tool or framework quickly. How did you approach it?",
        "How do you handle feedback on your design or code, especially when you disagree with it?",
        "What do you do when faced with conflicting priorities—like fixing bugs vs. shipping new features?",
        "Give an example of a team situation where you took responsibility even without being asked.",
        "What do you think is the most important personal quality a front-end developer needs, and how do you embody it?"
      ],
      "Pool2": [
        "How do you implement media queries in React, and what steps do you take to ensure the UI adapts well on Android, iPad, and laptops?",
        "Explain the difference between client-side rendering, server-side rendering, and static site generation. When do you use each?",
        "What strategies do you use to reduce bundle size and improve React app performance?",
        "Explain the reconciliation process in React. How does React decide what to re-render?",
        "How do you manage application-wide state? Compare Redux, Context API, and other options.",
        "How do you handle debouncing or throttling in search bars or scroll-based events?",
        "What is lazy loading, and how do you implement it in React?",
        "How do you manage environment variables and configuration for different environments (dev, staging, production)?",
        "When working with APIs, how do you handle loading states, caching, and error states in the UI?",
        "What security risks exist in front-end apps (XSS, CSRF, content injection), and how do you mitigate them?"
      ],
      "Pool3": [
        "Tell me about the toughest front-end bug or integration challenge you solved recently—how did you diagnose it, and what was the outcome?",
        "Describe a time when you were asked to redesign or rebuild a component. How did you handle user feedback and technical constraints?",
        "Talk about a time when working with a backend API was difficult—what did you do to ensure the UI still functioned smoothly?",
        "Tell me about a time when you had to choose between a quick fix and a long-term solution. What did you decide and why?",
        "Describe a situation when you collaborated with a designer. How did you bridge the gap between design expectations and technical feasibility?",
        "Talk about a moment when you had conflicting opinions with your teammates on how to build a feature. How did you resolve it?",
        "Tell me about a front-end feature you built that you’re most proud of. Why does it stand out?",
        "Describe a time when you had to work under a very tight deadline. What strategies helped you deliver?"
      ]
    }
  },
  "Backend Developer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past learning experience has prepared you the most for a backend development role?",
        "What motivates you to pursue backend development?",
        "Tell me about a moment when you realised you enjoy solving backend or system-level problems.",
        "How do you stay calm and systematic when production issues or server errors arise?",
        "Describe a time when you learned a new backend technology or concept quickly. How did you approach it?",
        "Backend work often involves invisible tasks. How do you stay motivated without immediate visual results?",
        "What personal quality do you think is most important for a backend developer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain the difference between REST APIs, GraphQL, and SOAP.",
        "What is the purpose of HTTP methods like GET, POST, PUT, PATCH, and DELETE?",
        "Describe how a server handles a request–response cycle.",
        "What is the difference between SQL databases and NoSQL databases? Give examples.",
        "Explain how authentication differs from authorization.",
        "What is middleware in backend frameworks (e.g., Express.js, Django, Spring Boot)?",
        "Explain indexing in databases. How does it improve query performance?",
        "What is CORS and why is it important?",
        "What is environment-based configuration? Why shouldn’t sensitive data be hard-coded?",
        "What are status codes? Explain common codes like 200, 400, 401, 403, 404, and 500."
      ],
      "Pool3": [
        "Tell me about the most difficult backend bug you solved—how did you diagnose it and what was the final fix?",
        "Describe a time when your API was working locally but failing in production. What steps did you take to find the issue?",
        "Tell me about a performance bottleneck you resolved. What tools or methods helped you?",
        "Tell me about a situation where you redesigned or refactored a backend module to make it more efficient.",
        "Tell me about a moment when you had to work on a feature with a very tight deadline. How did you plan and deliver?",
        "Tell me about a backend feature you built that you’re most proud of. Why does it stand out?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "Tell me about a moment when you realised you enjoy solving backend or system-level problems.",
        "How do you stay calm and systematic when production issues or server errors arise?",
        "Describe a time when you learned a new backend technology or concept quickly. How did you approach it?",
        "Backend work often involves invisible tasks. How do you stay motivated without immediate visual results?",
        "How do you handle feedback on your architecture, code quality, or API design?",
        "Tell me about a time you took responsibility for a backend issue even when the root cause wasn’t obvious.",
        "How do you manage conflicting priorities—like feature building, refactoring, and fixing bugs?",
        "What personal quality do you think is most important for a backend developer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain how you design a scalable API that can handle high traffic.",
        "How do you structure a backend application so that it remains modular and maintainable?",
        "Describe the steps you take to optimize slow database queries.",
        "How do you implement caching? Compare Redis, in-memory caching, and CDN-based caching.",
        "Explain how JWT works and how you secure token-based authentication.",
        "How do you handle file uploads safely, especially large files?",
        "Describe rate limiting. How do you implement it and why is it important?",
        "How do you detect and prevent common security threats like SQL injection, XSS, and CSRF?",
        "Explain message queues. Why and when would you use systems like RabbitMQ, Kafka, or AWS SQS?",
        "How do you handle database migrations in production without downtime?"
      ],
      "Pool3": [
        "Tell me about the most difficult backend bug you solved—how did you diagnose it and what was the final fix?",
        "Describe a time when your API was working locally but failing in production. What steps did you take to find the issue?",
        "Describe a time when you had to collaborate closely with front-end developers to design an API. What made it challenging?",
        "Tell me about a situation where you redesigned or refactored a backend module to make it more efficient.",
        "Describe a time when you had to deal with poor documentation or unclear requirements. What did you do?",
        "Tell me about a moment when you had to work on a feature with a very tight deadline. How did you plan and deliver?",
        "Describe a situation where you had to handle data inconsistency issues. How did you identify the cause?",
        "Describe a time a deployment went wrong. What happened, how did you respond, and what did you learn?"
      ]
    }
  },
  "UX Designer": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you to think from a user’s perspective?",
        "What excites you the most about becoming a UX designer?",
        "UX often involves multiple iterations. How do you stay motivated when your designs are repeatedly changed or rejected?",
        "Tell me about a moment when you realised you enjoy understanding user behaviour.",
        "How do you handle feedback that contradicts your design choices?",
        "UX design requires patience and empathy. How do you practice both in your work?",
        "What personal quality do you believe is most important for a UX designer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is your approach to understanding user needs before starting any design?",
        "Explain the difference between UX and UI design. Why are both important?",
        "What are user personas, and how do they guide design decisions?",
        "Describe what usability testing is. When should it be conducted?",
        "What are wireframes? How do they differ from prototypes?",
        "Explain Nielsen’s 10 Usability Heuristics and name at least three.",
        "What is information architecture? Why is it important in UX?",
        "How do you define user journeys and task flows?",
        "What tools do you use for low-fidelity and high-fidelity designs?",
        "Describe the importance of accessibility in UX design."
      ],
      "Pool3": [
        "Tell me about a UX problem you solved that had a major impact on user satisfaction. How did you approach it?",
        "Tell me about a time you redesigned a feature or flow. What improvements were made and how did you measure success?",
        "Tell me about a time when you simplified a complex interface. What was the result?",
        "Describe a time you conducted usability testing. What insights did you gain and how did they shape the final design?",
        "Tell me about a UX design you are most proud of. Why does it stand out?",
        "Describe a time your design failed or didn’t perform as expected. What did you learn from it?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "UX often involves multiple iterations. How do you stay motivated when your designs are repeatedly changed or rejected?",
        "How do you handle feedback that contradicts your design choices?",
        "Describe a time when you stepped in to solve a design-related problem even though it wasn’t assigned to you.",
        "What do you do when you feel creatively stuck or unable to generate new ideas?",
        "How do you balance user needs with business requirements when they conflict?",
        "UX design requires patience and empathy. How do you practice both in your work?",
        "What personal quality do you believe is most important for a UX designer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you plan and conduct user research when there is very little time or budget?",
        "Explain how you create, implement, or maintain a design system.",
        "How do you use analytics or behaviour-tracking tools (e.g., Hotjar, Google Analytics) to guide UX decisions?",
        "How do you validate whether a design change has actually improved user experience?",
        "What is cognitive load, and how do you reduce it in your designs?",
        "Explain how you conduct A/B testing and how you interpret the results.",
        "How do you design for multiple devices—mobile, tablet, and desktop—while maintaining consistency?",
        "How do you hand off your designs to developers to ensure accuracy?",
        "Describe how you use inclusive design principles when creating user experiences.",
        "What steps do you take to ensure user data privacy and compliance (e.g., GDPR) within UX design?"
      ],
      "Pool3": [
        "Tell me about a UX problem you solved that had a major impact on user satisfaction. How did you approach it?",
        "Describe a situation where your research findings contradicted stakeholder opinions. What did you do?",
        "Describe a moment when you had very unclear or incomplete requirements. How did you proceed?",
        "Tell me about a time when you simplified a complex interface. What was the result?",
        "Describe a situation where deadlines were tight, but user research was still needed. How did you balance both?",
        "Tell me about a conflict with a developer or product manager regarding a design decision. How did you resolve it?",
        "Describe a time you conducted usability testing. What insights did you gain and how did they shape the final design?",
        "Describe a time your design failed or didn’t perform as expected. What did you learn from it?"
      ]
    }
  },
  "Marketing": {
    "Basic": {
      "Pool1": [
        "What in your graduation or experience has prepared you for a marketing role?",
        "What excites you the most about working in marketing?",
        "Marketing requires constant creativity. How do you stay inspired when ideas don’t come easily?",
        "Tell me about a moment when you realised you enjoy understanding customer behaviour.",
        "How do you handle negative feedback on your campaign ideas or strategies?",
        "Describe a time when you took initiative to solve a marketing-related challenge without being asked.",
        "What personal quality do you believe is most important for a marketer, and how do you embody it?"
      ],
      "Pool2": [
        "Explain the 4Ps of marketing. How do they guide campaign creation?",
        "What is the difference between branding and marketing?",
        "What is a target audience? How do you define it for a new product?",
        "Explain what a customer journey is.",
        "What is segmentation? Why is it important in marketing?",
        "Describe organic vs. paid marketing with an example.",
        "What is a value proposition? Why does it matter?",
        "What are the key metrics you track in a basic marketing campaign?",
        "What is competitor analysis, and how do you conduct it?",
        "Explain the importance of storytelling in marketing."
      ],
      "Pool3": [
        "Tell me about a marketing campaign you worked on in college or in your locality. What made it successful?",
        "Tell me about a situation where you disagreed with the creative direction proposed by the team. How did you handle it?",
        "Give an example of a time you had to work under a very tight deadline for a campaign launch.",
        "Tell me about a time you managed a social media crisis or negative comments. What did you do?",
        "Describe a situation where you created a low-budget campaign that still performed well.",
        "Tell me about a marketing idea you’re especially proud of. What impact did it have?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a marketing role?",
        "What excites you the most about working in marketing?",
        "How do you handle negative feedback on your campaign ideas or strategies?",
        "Describe a time when you took initiative to solve a marketing-related challenge without being asked.",
        "How do you stay updated with trends and changes in the marketing world?",
        "What do you do when a campaign does not perform well despite your effort?",
        "How do you balance creativity with business needs and budget constraints?"
      ],
      "Pool2": [
        "How do you create a complete marketing funnel for a new product?",
        "Explain how you measure campaign effectiveness using analytics tools (Google Analytics, Meta Ads, etc.).",
        "How do you run A/B testing for ads or landing pages?",
        "Explain SEO vs. SEM. When do you use each?",
        "What strategies do you use to improve conversion rates on a landing page?",
        "How do you build and manage a brand’s social media presence?",
        "What steps do you take to develop a content marketing strategy?",
        "Explain how retargeting works and why it is effective.",
        "How do you handle a situation where the cost per lead (CPL) keeps increasing?",
        "Describe the process of creating a multi-channel campaign and ensuring message consistency."
      ],
      "Pool3": [
        "Describe a time when your campaign underperformed. What did you do to fix it?",
        "Tell me about a situation where you disagreed with the creative direction proposed by the team. How did you handle it?",
        "Describe a moment when you used customer insights to improve a marketing decision.",
        "Give an example of a time you had to work under a very tight deadline for a campaign launch.",
        "Describe a situation where you created a low-budget campaign that still performed well.",
        "Tell me about a moment when you identified a new market opportunity and recommended it to the team.",
        "Describe a time when collaboration with sales or product teams helped improve a campaign outcome."
      ]
    }
  },
  "Sales Executive": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a sales role?",
        "What motivates you the most about working in sales?",
        "Sales involve frequent rejection. How do you stay motivated?",
        "Tell me about a moment when you realised you enjoy building relationships with people.",
        "Describe a time you took the initiative to close a deal or help a customer without being asked.",
        "How do you balance being persuasive with being respectful and ethical?",
        "What personal quality do you think is most important for a Sales Executive, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What is the sales funnel? Explain each stage briefly.",
        "What does “qualifying a lead” mean? How do you do it?",
        "Explain the difference between B2B and B2C sales.",
        "What are open-ended questions in sales? Why are they useful?",
        "How do you identify customer needs during a conversation?",
        "What are the key components of a good sales pitch?",
        "Explain the importance of product knowledge in sales.",
        "What is rapport building? How do you build rapport with a new customer?",
        "What is objection handling? List some common objections.",
        "Why is follow-up important after the first interaction?"
      ],
      "Pool3": [
        "Tell me about the toughest sale you closed. What made it difficult, and how did you win it?",
        "Tell me about a situation where you turned a dissatisfied customer into a happy one.",
        "Describe a moment when you lost a major deal. What did you learn from it?",
        "Tell me about a time you had to convince a skeptical person. How did you approach it?",
        "Describe a situation where you had to handle a person’s objections. What was your strategy?",
        "Describe a moment when teamwork helped you close a deal."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Sales involve frequent rejection. How do you stay motivated?",
        "How do you react when a client dismisses or challenges your pitch?",
        "Describe a time you took the initiative to close a deal or help a customer without being asked.",
        "How do you handle pressure when you have monthly or weekly sales targets?",
        "What do you do when you feel your sales performance is not improving?",
        "How do you balance being persuasive with being respectful and ethical?"
      ],
      "Pool2": [
        "Explain how you plan and manage your sales pipeline effectively.",
        "Describe your approach to negotiating pricing with a customer.",
        "What are common closing techniques you use?",
        "How do you use CRM tools (e.g., HubSpot, Zoho, Salesforce) to manage leads?",
        "How do you track sales performance metrics like leads, conversions, and revenue?",
        "How do you identify upselling and cross-selling opportunities?",
        "What strategies do you use to reduce customer churn or increase retention?",
        "Explain how you handle customers who go silent after showing initial interest.",
        "How do you create urgency without pressuring the client unethically?",
        "What steps do you take to prepare for a sales presentation or meeting?"
      ],
      "Pool3": [
        "Tell me about the toughest sale you closed. What made it difficult, and how did you win it?",
        "Tell me about a situation where you turned a dissatisfied customer into a happy one.",
        "Describe a moment when you lost a major deal. What did you learn from it?",
        "Tell me about a time when you exceeded your sales targets. What contributed to your success?",
        "Describe a moment when teamwork helped you close a deal.",
        "Tell me about a time when you adapted your pitch for different customer segments.",
        "Describe a time when a deal was stuck for too long. How did you revive the conversation?"
      ]
    }
  },
  "Project Management": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a project management role?",
        "What motivates you most about managing projects and teams?",
        "Project management often involves pressure and deadlines. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoy planning, organizing, or coordinating work.",
        "How do you react when your project plan is challenged or changed by stakeholders?",
        "Describe a time you took initiative to solve a project issue without being asked.",
        "How do you handle situations where your team members miss deadlines or commitments?",
        "What do you do to improve yourself as a project manager when you notice gaps in your skills?",
        "How do you balance project constraints like time, budget, and quality when they conflict?",
        "What personal quality do you believe is most important for a project manager, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What are the five phases of the project life cycle?",
        "What is a project charter? Why is it important?",
        "Explain the difference between a project and operations.",
        "What is scope in project management? How do you define it?",
        "What tools do you use for project planning and scheduling (e.g., Gantt charts)?",
        "What is risk identification? Give an example.",
        "What is a stakeholder? How do you manage stakeholder expectations?",
        "Explain the difference between milestones and deliverables.",
        "Why is documentation important in project management?"
      ],
      "Pool3": [
        "Tell me about the most challenging project you managed. What made it tough, and how did you handle it?",
        "Describe a situation where a project was falling behind schedule. What steps did you take?",
        "Tell me about a conflict between team members. How did you resolve it?",
        "Tell me about a time you managed a project with unclear or changing requirements.",
        "Describe how you handled a major risk that suddenly became an issue.",
        "Tell me about a project where your leadership directly improved team performance.",
        "Describe a time when a deliverable failed or did not meet expectations. What did you learn?"
      ]
    },
    "Advanced": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a project management role?",
        "What motivates you most about managing projects and teams?",
        "Project management often involves pressure and deadlines. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoy planning, organizing, or coordinating work.",
        "How do you react when your project plan is challenged or changed by stakeholders?",
        "Describe a time you took initiative to solve a project issue without being asked.",
        "How do you handle situations where your team members miss deadlines or commitments?",
        "What do you do to improve yourself as a project manager when you notice gaps in your skills?",
        "How do you balance project constraints like time, budget, and quality when they conflict?",
        "What personal quality do you believe is most important for a project manager, and how do you demonstrate it?"
      ],
      "Pool2": [
        "Explain the difference between Agile, Waterfall, and Hybrid methodologies.",
        "How do you estimate project timelines using techniques like PERT or critical path method?",
        "How do you perform qualitative and quantitative risk analysis?",
        "Explain how you manage project scope creep.",
        "What strategies do you use for resource allocation and workload balancing?",
        "Describe your approach to budgeting and cost management.",
        "How do you measure project performance using KPIs or Earned Value Management (EVM)?",
        "What communication plan do you create for complex projects with multiple stakeholders?",
        "How do you manage vendor relationships and third-party dependencies?",
        "How do you conduct a project retrospective and ensure learnings are applied?"
      ],
      "Pool3": [
        "Tell me about the most challenging project you managed. What made it tough, and how did you handle it?",
        "Describe a situation where a project was falling behind schedule. What steps did you take?",
        "Tell me about a conflict between team members. How did you resolve it?",
        "Tell me about a time you managed a project with unclear or changing requirements.",
        "Describe how you handled a major risk that suddenly became an issue.",
        "Tell me about a time you had to manage multiple projects simultaneously. How did you prioritize?",
        "Describe a situation where your project exceeded the planned budget. What corrective actions did you take?",
        "Describe a time when a deliverable failed or did not meet expectations. What did you learn?"
      ]
    }
  },
  "Civil Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experiences has prepared you for a role as a civil engineer?",
        "What motivates you to pursue civil engineering as a career?",
        "Civil engineering projects can be high-pressure. How do you stay calm and focused on-site?",
        "Tell me about a moment when you realised you enjoy solving real-world structural or construction problems.",
        "How do you handle feedback or criticism on your design or estimation work?",
        "How do you ensure accuracy and attention to detail while preparing drawings, estimates, or reports?",
        "How do you stay updated with new construction techniques or industry standards?",
        "What personal quality do you believe is essential for a civil engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "What are the main types of cement? Where is each type used?",
        "Explain the difference between working stress method and limit state method.",
        "What are the common tests used to check the quality of concrete?",
        "What is the purpose of surveying in civil engineering?",
        "Explain compaction and its importance in soil engineering.",
        "What is the difference between a slab, beam, and column?",
        "What is slump test in concrete? What does it indicate?",
        "Explain the concept of factor of safety.",
        "What is the difference between dead load and live load?",
        "What are the common types of foundations? Give examples."
      ],
      "Pool3": [
        "Tell me about a construction or structural issue you solved. What steps did you take to diagnose and fix it?",
        "Describe a situation where your project was getting delayed. What did you do to bring it back on schedule?",
        "Describe a time you managed conflict between contractors, workers, or stakeholders.",
        "Tell me about a scenario where unexpected soil conditions affected your project. How did you handle it?",
        "Describe a challenging estimation or quantity surveying task you completed.",
        "Tell me about a time you worked under tight deadlines or adverse weather conditions.",
        "Describe a project where you contributed significantly to cost reduction, safety, or quality improvement."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Civil engineering projects can be high-pressure. How do you stay calm and focused on-site?",
        "Tell me about a moment when you realised you enjoy solving real-world structural or construction problems.",
        "How do you handle feedback or criticism on your design or estimation work?",
        "Describe a time you took initiative to solve an engineering or technical problem without being asked.",
        "How do you ensure accuracy and attention to detail while preparing drawings, estimates, or reports?",
        "How do you stay updated with new construction techniques or industry standards?",
        "Civil work often happens outdoors in challenging environments. How do you balance safety and productivity?",
        "What personal quality do you believe is essential for a civil engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you determine the type of foundation required based on soil conditions?",
        "Explain how you design a reinforced concrete beam for bending and shear.",
        "How do you conduct a mix design for M-grade concrete?",
        "What steps do you take to ensure quality control during construction?",
        "Explain how you estimate cost, materials, and quantity for a large project.",
        "How do you select appropriate construction materials for durability and environment?",
        "What is pre-stressed concrete? When is it preferred over RCC?",
        "Explain the difference between static and dynamic load analysis.",
        "How do you manage waterlogging and drainage issues at a construction site?",
        "How do you apply relevant codes (IS codes or standards) in design and construction?"
      ],
      "Pool3": [
        "Tell me about a time when you had to enforce safety rules on-site. How did you handle resistance?",
        "Describe a situation where a design was not feasible on-site. How did you modify or resolve it?",
        "Tell me about a moment when you discovered poor workmanship. What actions did you take?",
        "Describe a time you managed conflict between contractors, workers, or stakeholders.",
        "Tell me about a scenario where unexpected soil conditions affected your project. How did you handle it?",
        "Describe a challenging estimation or quantity surveying task you completed.",
        "Tell me about a time you worked under tight deadlines or adverse weather conditions.",
        "Describe a project where you contributed significantly to cost reduction, safety, or quality improvement."
      ]
    }
  },
  "Mechanical Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for a mechanical engineering role?",
        "What motivates you to work in mechanical engineering?",
        "Mechanical engineering often involves problem-solving under pressure. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoyed understanding how machines and systems work.",
        "How do you handle feedback or criticism on your designs, calculations, or reports?",
        "How do you ensure accuracy in measurements, drawings, or simulations?",
        "How do you stay updated with new manufacturing methods or mechanical technologies?",
        "What personal quality do you believe is essential for a mechanical engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "State the first law of thermodynamics. How is it applied in real systems?",
        "What is the difference between stress and strain?",
        "Explain the concepts of laminar flow and turbulent flow.",
        "What is entropy? Why is it important?",
        "Describe different types of fits (interference, clearance, transition).",
        "What are the common manufacturing processes (casting, forging, machining, welding)?",
        "What is Bernoulli’s equation? Where is it used?",
        "Explain the difference between a boiler and a heat exchanger.",
        "What is fatigue failure? What causes it?",
        "What are the common types of gears? Give examples of where each is used."
      ],
      "Pool3": [
        "Tell me about a mechanical or thermal problem you solved. How did you diagnose it?",
        "Describe a time when a machine or system failed unexpectedly. What did you do?",
        "Tell me about a situation where you improved a design, process, or component.",
        "Describe a situation where you had to coordinate with electrical, civil, or production teams.",
        "Tell me about a design that initially failed testing. How did you revise it?",
        "Tell me about a quality control issue you resolved.",
        "Describe a project where your contribution significantly improved efficiency, cost, or reliability."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Mechanical engineering often involves problem-solving under pressure. How do you stay calm and focused?",
        "Tell me about a moment when you realised you enjoyed understanding how machines and systems work.",
        "How do you handle feedback or criticism on your designs, calculations, or reports?",
        "Describe a time you took initiative to fix a mechanical or technical problem without being asked.",
        "How do you stay updated with new manufacturing methods or mechanical technologies?",
        "What do you do when a machine or experiment repeatedly fails during testing?",
        "What personal quality do you believe is essential for a mechanical engineer, and how do you demonstrate it?"
      ],
      "Pool2": [
        "How do you approach designing a machine component to withstand dynamic loads?",
        "Explain how you would calculate heat transfer through a composite wall.",
        "How do you select materials based on strength, temperature, and environmental requirements?",
        "What steps do you take to perform a finite element analysis (FEA) on a component?",
        "Explain how CNC machines work and how you prepare a part program.",
        "How do you optimize a production system using lean manufacturing principles?",
        "Explain how a refrigeration cycle works and its major components.",
        "How do you evaluate vibration in rotating machinery?",
        "Describe the difference between hydraulic and pneumatic systems. When would you use each?",
        "How do you incorporate safety standards and tolerances into mechanical design?"
      ],
      "Pool3": [
        "Describe a time when a machine or system failed unexpectedly. What did you do?",
        "Tell me about a situation where you improved a design, process, or component.",
        "Describe a moment when you had to deal with limited resources or a tight budget.",
        "Tell me about a time you noticed a safety risk during manufacturing or testing. What did you do?",
        "Describe a situation where you had to coordinate with electrical, civil, or production teams.",
        "Tell me about a design that initially failed testing. How did you revise it?",
        "Describe a time you worked under tight deadlines for fabrication or assembly.",
        "Describe a project where your contribution significantly improved efficiency, cost, or reliability."
      ]
    }
  },
  "Electrical Engineering": {
    "Basic": {
      "Pool1": [
        "What in your graduation or past experience has prepared you for an electrical engineering role?",
        "What motivates you to pursue electrical engineering as a career?",
        "Electrical work involves strict safety compliance. How do you stay disciplined and careful on-site or in labs?",
        "Tell me about a moment when you realised you enjoy working with circuits, machines, or electrical systems.",
        "How do you maintain accuracy and avoid mistakes while working on complex circuits?",
        "How do you stay updated with new technologies or electrical standards?",
        "What do you do when you face repeated failures during testing or prototyping?",
        "What personal quality do you believe is essential for an electrical engineer, and how do you embody it?"
      ],
      "Pool2": [
        "What is Ohm’s Law? Give a practical example.",
        "Explain the difference between AC and DC supply.",
        "What are the main types of electrical machines (motors and generators)?",
        "What is power factor? Why is it important?",
        "Explain Kirchhoff’s Current Law (KCL) and Voltage Law (KVL).",
        "What are transformers used for?",
        "What is the difference between a fuse and a circuit breaker?",
        "Explain the purpose of earthing/grounding in electrical systems.",
        "What are the common types of electrical loads?",
        "What are capacitors and inductors? Give basic applications for each."
      ],
      "Pool3": [
        "Tell me about a complex electrical problem you solved. How did you diagnose and fix it?",
        "Tell me about a time you implemented a design improvement to increase efficiency or safety.",
        "Tell me about a time you identified a major safety risk. What did you do next?",
        "Describe a situation where you worked with other engineering teams (mechanical, civil, electronics) to solve an issue.",
        "Tell me about a design or calculation that initially failed. How did you revise it?",
        "Describe a moment when you had to troubleshoot complex equipment with limited documentation.",
        "Tell me about a maintenance challenge you resolved under tight deadlines.",
        "Describe a project where your contribution significantly improved reliability, cost, or energy efficiency."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Electrical work involves strict safety compliance. How do you stay disciplined and careful on-site or in labs?",
        "Tell me about a moment when you realised you enjoy working with circuits, machines, or electrical systems.",
        "How do you respond when your calculations or circuit designs are challenged or criticised?",
        "Describe a time you took initiative to diagnose or fix an electrical issue without being asked.",
        "How do you maintain accuracy and avoid mistakes while working on complex circuits?",
        "How do you stay updated with new technologies or electrical standards?",
        "What do you do when you face repeated failures during testing or prototyping?",
        "What personal quality do you believe is essential for an electrical engineer, and how do you embody it?"
      ],
      "Pool2": [
        "How do you select the right transformer for a given load and voltage level?",
        "Explain how you analyse harmonics and their impact on electrical systems.",
        "Describe the working principle of a three-phase induction motor.",
        "How do you design and evaluate protection schemes like relays and circuit breakers?",
        "Explain how you calculate fault levels in a distribution system.",
        "How do you perform load flow analysis? What tools or methods do you use?",
        "Explain PID control and where it is used in electrical engineering.",
        "How do you size cables based on current, temperature, and installation conditions?",
        "Describe how renewable energy sources (solar, wind) integrate into the grid.",
        "What steps do you take to improve energy efficiency in electrical systems?"
      ],
      "Pool3": [
        "Tell me about a complex electrical problem you solved. How did you diagnose and fix it?",
        "Describe a situation where an electrical system failed or tripped unexpectedly. What actions did you take?",
        "Tell me about a time you implemented a design improvement to increase efficiency or safety.",
        "Describe a moment when you had to handle a high-pressure situation involving power failure or urgent repair.",
        "Describe a moment when you had to troubleshoot complex equipment with limited documentation.",
        "Tell me about a maintenance challenge you resolved under tight deadlines.",
        "Describe a project where your contribution significantly improved reliability, cost, or energy efficiency."
      ]
    }
  },
  "Electronics and Communication (Embedded Systems and IoT)": {
  "Basic": {
    "Pool1": [
      "What in your graduation or past experience has prepared you for the role?",
      "What excites you the most about working with embedded hardware or IoT technologies?",
      "Embedded work often requires long debugging hours. How do you stay patient and focused?",
      "Tell me about a moment when you realised you enjoy building or troubleshooting electronics.",
      "How do you stay updated with new microcontrollers, sensors, protocols, and IoT technologies?",
      "What do you do when unexpected behaviour occurs during testing of embedded devices?",
      "What personal quality do you believe is essential for an embedded/IoT engineer, and how do you demonstrate it?"
    ],
    "Pool2": [
      "What is the difference between a microcontroller and a microprocessor?",
      "Explain the functioning of GPIO pins. Give an example of use.",
      "What is the purpose of ADC and DAC in embedded systems?",
      "Explain common communication protocols such as UART, I2C, SPI.",
      "What is PWM? Where is it used?",
      "Describe the difference between analog and digital sensors.",
      "What is a pull-up resistor, and why is it used?",
      "Explain the basic architecture of Arduino or ESP32.",
      "What is debouncing in embedded systems?",
      "What is a watchdog timer, and why is it important?"
    ],
    "Pool3": [
      "Tell me about the most challenging embedded system bug you solved. How did you debug it?",
      "Describe a situation where your device worked in the lab but failed in the field. What did you do?",
      "Tell me about a time when your sensor readings were inaccurate. How did you correct them?",
      "Describe a moment when your communication protocol failed or behaved unpredictably.",
      "Tell me about a time you built a prototype under tight deadlines.",
      "Tell me about a moment when you improved the power efficiency or performance of an embedded device.",
      "Tell me about a scenario where your IoT device lost connectivity. What steps did you take to diagnose the issue?",
      "Describe a project where your contribution significantly improved reliability, cost, or performance."
    ]
  },

  "Advanced": {
    "Pool1": [
      "What in your graduation or past experience has prepared you for embedded systems or IoT roles?",
      "Embedded work often requires long debugging hours. How do you stay patient and focused?",
      "How do you respond when your circuit or firmware doesn’t work after multiple attempts?",
      "Describe a time you took initiative to fix a hardware or software issue without being asked.",
      "How do you stay updated with new microcontrollers, sensors, protocols, and IoT technologies?",
      "How do you ensure accuracy and avoid mistakes when working with schematics, PCBs, or code?",
      "What do you do when unexpected behaviour occurs during testing of embedded devices?"
    ],
    "Pool2": [
      "How do you design an IoT system end-to-end—from sensor to cloud?",
      "What are the advantages of using RTOS over bare-metal programming?",
      "Explain how you optimize power consumption in battery-powered IoT devices.",
      "How do you choose between different wireless communication protocols (BLE, LoRa, Zigbee, Wi-Fi)?",
      "Describe how OTA (Over-The-Air) firmware updates work and how you implement them.",
      "How do you secure IoT devices against common cyber threats?",
      "What steps do you take to ensure reliable communication in noisy environments?",
      "How do you handle memory constraints in microcontrollers?",
      "Explain MQTT protocol. When is it preferred over HTTP?",
      "Describe how you integrate embedded devices with cloud platforms (AWS IoT, Azure IoT, Google Cloud IoT)."
    ],
    "Pool3": [
      "Describe a situation where your device worked in the lab but failed in the field. What did you do?",
      "Tell me about a time when your sensor readings were inaccurate. How did you correct them?",
      "Describe a moment when your communication protocol failed or behaved unpredictably.",
      "Tell me about a time you built a prototype under tight deadlines.",
      "Describe a situation where you had to coordinate with hardware and software teams to solve an issue.",
      "Tell me about a moment when you improved the power efficiency or performance of an embedded device.",
      "Describe a time a PCB you designed or used had issues. How did you troubleshoot it?",
      "Tell me about a scenario where your IoT device lost connectivity. What steps did you take to diagnose the issue?"
    ]
  }
  },
  "Business Analyst": {
  "Basic": {
    "Pool1": [
      "What in your graduation or past experiences has prepared you for a business analyst role?",
      "What motivates you to work as a business analyst?",
      "Business analysis requires strong attention to detail. How do you stay organised during complex tasks?",
      "Tell me about a moment when you realised you enjoy analysing data, processes, or requirements.",
      "How do you respond when stakeholders question your analysis or documentation?",
      "Describe a time you took initiative to solve a business problem without being asked.",
      "How do you balance user needs with business constraints?",
      "What do you do when a requirement is unclear or contradictory?",
      "How do you stay updated with tools, frameworks, and industry trends relevant to business analysis?",
      "What personal quality do you believe is essential for a business analyst, and how do you demonstrate it?"
    ],
    "Pool2": [
      "What is the primary role of a business analyst in a project?",
      "Explain the difference between requirements and specifications.",
      "What is a user story? What are its components?",
      "What is a process flow diagram?",
      "What are KPIs and why are they important?",
      "What is stakeholder mapping?",
      "Explain the difference between qualitative and quantitative data?",
      "What is a gap analysis?",
      "What is requirement traceability?",
      "What is the purpose of acceptance criteria?"
    ],
    "Pool3": [
      "Describe a time when limited data made your analysis difficult. What did you do?",
      "Tell me about a moment when you improved a small process or routine.",
      "Describe a situation where you clarified requirements for someone.",
      "Tell me about a time you worked with someone who disagreed with your approach.",
      "Describe a moment where you had to explain a concept to a non-technical person.",
      "Tell me about a time when you had to meet a deadline with minimal guidance.",
      "Describe a situation where your assumption turned out to be wrong.",
      "Tell me about a time you helped your team solve a problem.",
      "Describe a time when two people misunderstood each other. How did you help?",
      "Tell me about a moment where you handled conflicting expectations."
    ]
  },
  "Advanced": {
    "Pool1": [
      "How do you handle situations where stakeholders disagree with your analysis?",
      "What do you do when a business decision you recommended is not accepted?",
      "Describe how you ensure your work remains unbiased when analysing conflicting data.",
      "How do you prioritise tasks when everything seems urgent?",
      "Tell me about a time you took full responsibility for a mistake in your analysis.",
      "How do you adapt when project requirements or goals change suddenly?",
      "Describe a time you resolved a communication gap between two teams.",
      "How do you push back professionally when a deadline is unrealistic?",
      "What do you do to maintain a long-term problem-solving mindset under pressure?"
    ],
    "Pool2": [
      "How do you gather complex requirements from multiple stakeholders?",
      "Explain how you use tools like SQL, Excel, or Power BI for analysis.",
      "How do you create AS-IS and TO-BE process models?",
      "Explain MoSCoW prioritisation with an example.",
      "Describe the 5 Whys or Fishbone method for root-cause analysis.",
      "How do you validate requirements to avoid rework?",
      "Explain how you conduct feasibility analysis (technical, operational, financial).",
      "How do you document non-functional requirements effectively?",
      "How do you prepare wireframes or prototypes to validate ideas?",
      "How do you measure the success of a solution post-implementation?"
    ],
    "Pool3": [
      "Tell me about a complex business problem you solved using data.",
      "Describe a time when requirements kept changing throughout the project.",
      "Tell me about a situation where two major stakeholders had opposing priorities.",
      "Describe a moment when your analysis influenced an important decision.",
      "Tell me about a time you led a requirements workshop or stakeholder meeting.",
      "Describe a situation where you uncovered a major flaw in an existing process.",
      "Tell me about a time you dealt with incomplete or contradictory data.",
      "Describe a moment when your analysis was initially wrong. How did you correct it?",
      "Tell me about a scenario where you had to balance user needs, business goals, and technical feasibility.",
      "Describe a project where your work significantly impacted business performance or efficiency."
    ]
  }
  },
  "Digital Marketing": {
  "Basic": {
    "Pool1": [
      "What interests you the most about digital marketing?",
      "What in your graduation or past experience has prepared you for this role?",
      "How do you stay motivated when a campaign does not perform well?",
      "Describe how you stay updated with online trends.",
      "How do you handle repetitive tasks like posting content or monitoring campaigns?",
      "What do you do when you face a concept or tool you don’t understand?",
      "How do you approach learning new platforms like Google Ads or Meta Ads?",
      "How do you react when your ideas are rejected by the team or client?",
      "What steps do you take to stay organised while managing multiple campaigns?",
      "How do you maintain creativity on days when inspiration is low?"
    ],
    "Pool2": [
      "What are the main channels of digital marketing?",
      "What is SEO and why is it important?",
      "Explain the difference between organic and paid marketing.",
      "What are impressions, reach, and engagement?",
      "Explain CTA (Call to Action).",
      "What is a conversion? Give an example.",
      "What is a landing page and why is it important?",
      "What tools can you use to schedule social media posts?",
      "What is the difference between B2B and B2C digital marketing?",
      "Explain the basic structure of a Google Ads search campaign."
    ],
    "Pool3": [
      "Tell me about a time you created content that performed well.",
      "Describe a situation when a client or teammate misunderstood your idea.",
      "Tell me about a moment when a campaign performed poorly. How did you react?",
      "Describe how you helped your team fix a simple marketing issue.",
      "Tell me about a time you learned a digital tool quickly to complete a task.",
      "Describe a moment when you had to work under a tight deadline.",
      "Tell me about a situation where you analysed basic campaign data to draw insights.",
      "Describe how you handled negative feedback on a design or post.",
      "Tell me about a time you identified a small improvement in a campaign.",
      "Describe how you adjusted content to match a target audience’s preferences."
    ]
  },
  "Advanced": {
    "Pool1": [
      "Describe a time you used data to convince someone of your marketing idea.",
      "How do you handle conflict between creative direction and business goals?",
      "Digital marketing requires constant experimentation. How do you handle failures?",
      "What do you do when your marketing strategy conflicts with a client's demand?",
      "Describe how you prioritise tasks when multiple campaigns go live at once.",
      "Tell me about a time you took responsibility for a performance issue in a campaign.",
      "Explain how you balance creativity with data-driven decisions.",
      "How do you adapt when algorithms or platform rules change suddenly?",
      "Tell me about a time you influenced a decision without authority.",
      "What’s your approach when senior stakeholders push for an idea you don’t agree with?"
    ],
    "Pool2": [
      "How do you set up a full-funnel digital marketing strategy?",
      "Explain how Google Analytics or GA4 helps measure user behaviour.",
      "How do you optimise ad campaigns to reduce cost per lead (CPL)?",
      "Describe how you perform keyword research effectively.",
      "How do you conduct A/B testing for ads or landing pages?",
      "Explain how retargeting works and why it is powerful.",
      "What’s your process for improving conversion rates on a landing page?",
      "How do you build custom audiences and lookalike audiences?",
      "What KPIs would you track for an e-commerce campaign?",
      "How do you maintain cross-channel consistency in messaging?"
    ],
    "Pool3": [
      "Tell me about a campaign you managed that delivered exceptional results. What made it successful?",
      "Describe a time when you had to fix a high CPL issue. What changes did you make?",
      "Tell me about a conflict between creative teams and performance teams. How did you handle it?",
      "Describe a moment when poor data quality affected your decisions. What did you do?",
      "Tell me about a time when you redesigned an entire marketing funnel.",
      "Describe a situation where your audience targeting wasn’t working. How did you diagnose it?",
      "Tell me about a multi-channel campaign you worked on. How did you maintain consistency?",
      "Describe a moment when you had to educate a client about realistic expectations.",
      "Tell me about a time your analysis significantly improved a campaign’s ROI.",
      "Describe a project where you used insights to pivot the entire marketing strategy."
    ]
  }
  },
  "Customer Service": {
  "Basic": {
    "Pool1": [
      "What in your education or past experience has prepared you for a customer service role?",
      "What interests you the most about working in customer service?",
      "How do you stay calm when someone speaks to you rudely?",
      "Describe how you make a customer feel heard and valued.",
      "What do you do when you don’t know the answer to a customer’s question?",
      "How do you handle repetitive tasks like answering similar queries?",
      "How do you react when someone corrects your mistake?",
      "What steps do you take to stay organised during busy hours?",
      "How do you ensure you communicate clearly with customers?",
      "How do you handle pressure during peak customer call or chat times?"
    ],
    "Pool2": [
      "What is the purpose of a customer service department?",
      "What does good customer service mean to you?",
      "What is the difference between customer support and customer success?",
      "What is active listening?",
      "What are the basics of phone/email/chat etiquette?",
      "What is a support ticket?",
      "How do you record a customer complaint properly?",
      "Why is following up with customers important?",
      "What does 'closing a ticket' mean?",
      "What are FAQs, and why are they important in customer service?"
    ],
    "Pool3": [
      "Tell me about a time you handled a polite but confused person.",
      "Describe a moment when you helped a customer who was new or unfamiliar with the product.",
      "Tell me about a situation where you had to apologise to a customer.",
      "Describe how you handled a customer who asked many repeated questions.",
      "Tell me about a time you explained a technical feature in simple terms.",
      "Describe a moment when you calmed down a slightly irritated customer.",
      "Tell me about a time when you handled a queue of customers efficiently.",
      "Describe a situation where a customer misunderstood you. How did you fix it?",
      "Tell me about a moment when you solved a small issue that made a big impact for the customer.",
      "Describe how you handled a customer who kept changing their mind."
    ]
  },
  "Advanced": {
    "Pool1": [
      "Describe a time you went out of your way to help a customer.",
      "How do you handle a situation where a customer keeps interrupting you?",
      "Tell me about a time you managed an angry or frustrated customer successfully.",
      "How do you take responsibility when a customer issue escalates?",
      "Describe how you balance empathy with company policies.",
      "How do you maintain professionalism when a customer is unreasonable?",
      "Tell me about a time you mediated a conflict between two customers or team members.",
      "Describe how you handle situations where customers demand unrealistic solutions.",
      "What do you do when your team is overwhelmed and you must take initiative?",
      "How do you stay resilient during long hours of customer interaction?"
    ],
    "Pool2": [
      "How do you use CRM tools like Zendesk, Freshdesk, or Salesforce?",
      "What KPIs do you think are most important in customer service?",
      "How do you identify when an issue requires escalation?",
      "What is the difference between Tier 1 and Tier 2 support?",
      "How do you handle SLAs (Service Level Agreements)?",
      "Describe how you diagnose recurring customer issues using data.",
      "How do you collaborate with product or technical teams to solve complex issues?",
      "What steps do you take to improve customer satisfaction scores (CSAT)?",
      "How do you measure and respond to customer feedback trends?",
      "Explain how you manage multiple tickets at once without compromising quality."
    ],
    "Pool3": [
      "Tell me about the most difficult customer you’ve ever handled. What was the outcome?",
      "Describe a time when a customer issue was unresolved for a long time. How did you take ownership?",
      "Tell me about a situation where you had to deliver bad news to a customer.",
      "Describe a moment when a customer blamed you for something out of your control.",
      "Tell me about a situation where you handled a customer’s anger professionally and successfully.",
      "Describe a case where you coordinated with multiple teams to solve a complex problem.",
      "Tell me about a moment when a customer demanded something against company policy. What did you do?",
      "Describe how you handled a situation where multiple customers were upset at the same time.",
      "Tell me about a scenario where your solution prevented an escalation.",
      "Describe a customer service case where your actions significantly improved customer loyalty or retention."
    ]
  }
  },
  "Teacher": {
    "Basic": {
      "Pool1": [
        "What inspired you to teach your subject, and how do you keep your passion alive?",
        "How do you ensure students understand the fundamentals of your subject?",
        "What steps do you take to simplify complex concepts in your subject area?",
        "How do you handle students who show no interest in your subject?",
        "How do you stay updated with new trends or developments in your teaching field?",
        "How do you respond when a student challenges your explanation of a subject concept?",
        "What is your approach to handling diverse learning speeds in your subject-based classes?",
        "How do you incorporate real-life examples from your subject area to make learning engaging?",
        "What do you do to build confidence in students who struggle in your subject?",
        "How do you evaluate your effectiveness in teaching your subject?"
      ],
      "Pool2": [
        "Tell me about a time you helped a struggling student understand a difficult topic.",
        "Describe a classroom situation where your explanation didn’t work. What did you do next?",
        "Tell me about a moment you handled a disruptive student without affecting the class flow.",
        "Describe a time you used an unconventional method to teach a topic.",
        "Tell me about a class where students were losing interest. How did you re-engage them?",
        "Describe a time you had to manage a large class while ensuring everyone understood the lesson.",
        "Tell me about a class activity that worked exceptionally well. Why was it effective?",
        "Describe a situation where a student misunderstood a concept because of your teaching. How did you fix it?",
        "Tell me about a lesson plan you changed at the last minute. Why and how?",
        "Describe a difficult teaching day and how you maintained your professionalism."
      ]
    },
    "Advanced": {
      "Pool1": [
        "How do you integrate your research interests into your teaching practice?",
        "Describe how your subject expertise and research background complement one another.",
        "How do you encourage students to think beyond textbooks and into inquiry or research?",
        "What motivates you to pursue research alongside teaching?",
        "How do you ensure your teaching reflects the latest research in your field?",
        "Describe a time your research experience improved your classroom delivery.",
        "What is your approach to balancing teaching workload with research commitments?",
        "How do you respond when your research findings contradict existing curriculum content?",
        "What steps do you take to build academic curiosity in students?",
        "How do you mentor students who show interest in research?"
      ],
      "Pool2": [
        "Tell me about a time your research experience helped you solve a classroom challenge.",
        "Describe a situation where you guided a student through a research or project-based assignment.",
        "Tell me about a conflict between academic requirements and new research evidence.",
        "Describe how you handled a student group that struggled with analytical or research skills.",
        "Tell me about a time you incorporated a recent research paper into your teaching.",
        "Describe a situation where your research faced setbacks but you still had teaching responsibilities.",
        "Tell me about a time you supervised an academic project or presentation effectively.",
        "Describe a time you encouraged students to question a concept using a research mindset.",
        "Tell me about a classroom discussion where your research background enriched the learning experience.",
        "Describe a moment you identified a research opportunity from your teaching environment."
      ]
    }
  },
  "General": {
    "Basic": {
      "Pool1": [
        "What in your education or background has prepared you for professional work?",
        "What motivates you to apply for jobs at this stage of your career?",
        "How do you stay organised when handling multiple tasks?",
        "Describe how you learn new skills or tools.",
        "How do you handle situations where instructions aren’t clear?",
        "What do you do when you face a problem you don’t immediately know how to solve?",
        "How do you stay productive on days when you feel low or distracted?",
        "How do you respond when someone corrects you or gives feedback?",
        "What steps do you take to manage your time effectively?",
        "How do you ensure you communicate clearly with others?"
      ],
      "Pool2": [
        "What are professional ethics, and why are they important?",
        "How do you collaborate effectively in a team?",
        "What is the purpose of documentation in any job?",
        "What basic digital tools are you comfortable using (e.g., email, spreadsheets)?",
        "Why is customer or stakeholder communication important?",
        "What does “problem-solving” mean to you?",
        "What is the difference between tasks, goals, and outcomes?",
        "How do you approach learning a new tool or software?",
        "What is the importance of deadlines in the workplace?",
        "How do you ensure your work meets basic quality standards?"
      ],
      "Pool3": [
        "Tell me about a time you worked with someone who had a different working style.",
        "Describe a moment when you received unclear instructions. What did you do?",
        "Tell me about a time you helped someone on your team.",
        "Describe a situation when you had to learn something quickly.",
        "Tell me about a moment when you handled a small mistake effectively.",
        "Describe a time you adjusted your communication style for someone.",
        "Tell me about a situation where you balanced multiple tasks at once.",
        "Describe a moment when you resolved a simple conflict or misunderstanding.",
        "Tell me about a time when you suggested a small improvement in your team or workflow.",
        "Describe a situation where you had to meet a deadline with limited time."
      ]
    },
    "Advanced": {
      "Pool1": [
        "Describe a time you took initiative even when it wasn’t expected.",
        "How do you handle situations where colleagues disagree with your approach?",
        "Tell me about a time you overcame a major setback.",
        "How do you decide what to prioritise when everything feels urgent?",
        "Describe a moment when you influenced someone without formal authority.",
        "How do you stay calm and professional in stressful situations?",
        "Tell me about a time you took responsibility for a mistake.",
        "How do you ensure your decisions are fair and unbiased?",
        "Describe how you manage long-term goals alongside daily tasks.",
        "What do you do to maintain continuous improvement in your work style?"
      ],
      "Pool2": [
        "How do you analyse a problem before proposing a solution?",
        "Describe how you make data-driven decisions in your work.",
        "What steps do you take to plan a small project from start to finish?",
        "How do you handle documentation for complex tasks or projects?",
        "What strategies do you use to ensure long-term goals align with daily activities?",
        "How do you measure success or performance in your role?",
        "How do you handle cross-functional collaboration?",
        "What frameworks do you use to break down large problems into smaller parts?",
        "How do you track your progress on tasks and deliverables?",
        "What methods do you use to evaluate risks before making decisions?"
      ],
      "Pool3": [
        "Tell me about a major problem you solved that made a significant impact.",
        "Describe a time you handled a conflict between team members or stakeholders.",
        "Tell me about a situation where you had to make a difficult decision with limited information.",
        "Describe a moment when you managed an unexpected crisis professionally.",
        "Tell me about a time you took the lead during a challenging situation.",
        "Describe a situation where your analysis or judgment prevented a bigger issue.",
        "Tell me about a time you significantly improved a process or system.",
        "Describe a scenario where you had to push back against unrealistic expectations.",
        "Tell me about a time you handled a long-term project with many moving parts.",
        "Describe a situation where your work directly contributed to measurable success."
      ]
    }
  }
}
